[
    {
        "nivel": "",
        "assunto": "",
        "numero": "1039",
        "saida": "Para cada instância imprima uma única linha contendo MORTO, se o caçador morre, ou RICO se o caçador consegue colher a flor.",
        "descricao": "Nos dias atuais uma flor de fogo não é algo considerado estranho para muitos jovens.  Isso porque um famoso jogo de videogame popularizou esse tipo de flor. Nesse jogo o protagonista ganhava superpoderes ao tocar em uma flor de fogo, passando a atirar pequenas bolas de fogo para derrotar seus inimigos. No entanto, já se falava sobre flores de fogo há muito tempo atrás. Na mitologia polonesa, flores de fogo são flores místicas de grande poder guardadas por espíritos malignos. Ela possuía esse nome porque brilhava tanto que era impossível olhá-la diretamente. Quem possuísse uma flor dessas ganharia a habilidade de ler a mente de outras pessoas, encontrar tesouros escondidos e repelir todos os males. Para obter uma flor de fogo, a pessoa deveria procurá-la em uma floresta antes da meia-noite na véspera do Noc Kupały. Exatamente à meia-noite ela floresceria. Para colhê-la seria preciso desenhar um círculo em volta dela. Parece uma tarefa fácil, no entanto, os espíritos malignos que guardam a flor tentariam de tudo para distrair qualquer um tentando colher a flor. Se a pessoa falhasse ao tentar desenhar um círculo em volta da flor, teria sua vida sacrificada. Dados dois círculos, um desenhado por um ambicioso caçador de flores de fogo e outro representando a área da flor, sua tarefa é determinar se o caçador morre ou fica rico com sua conquista.",
        "titulo": "Flores de Fogo",
        "entrada": "A entrada é composta por diversas instâncias e termina com final de arquivo (EOF). Cada instância consiste em uma linha com seis inteiros, R1 (1 ≤ R1) , X1(|X1|), Y1(|Y1|), R2 (R2 ≤ 1000), X2(|X2|), Y2 (Y2 ≤ 1000). O círculo desenhado pelo caçador possui raio R1 e centro (X1; Y1). O círculo representando a área da flor possui raio R2 e centro (X2; Y2)."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1223",
        "saida": "Para cada caso de teste imprima uma linha contendo um único número, com exatamente duas casas decimais, indicando o maior diâmetro de bolinha tal que esta consiga percorrer todo o brinquedo.",
        "descricao": "Uma fábrica quer produzir um tobogan de brinquedo como o da figura abaixo, composto de duas hastes de madeira sustentando aletas que se alternam nas duas hastes. Uma bolinha de aço é solta na aleta mais alta do tobogan; sob efeito da gravidade, a bolinha desliza pelas aletas, terminando por sair do brinquedo. O projeto do brinquedo, contendo as especificações do tamanho, posição e inclinação das hastes e de cada aleta, foi feito pelo dono da fábrica, e milhares de unidades já estão sendo confeccionadas na China. O gerente da fábrica foi incumbido de comprar as bolinhas de aço, mas antes de fazer o pedido das milhares de bolinhas quer saber o diâmetro máximo da bolinha, para que esta não pare no meio do brinquedo. Figura 1: Dois exemplos: em (a) a bolinha chega ao final, e (b) a bolinha para no meio do brinquedo e não chega ao final. O gerente da fábrica quer que você escreva um programa que, dadas as especificações do brinquedo, determine o diâmetro máximo da bolinha para que esta não pare no meio do brinquedo.",
        "titulo": "Tobogan de Bolinhas",
        "entrada": "A primeira linha de um caso de teste contém um inteiro N (1 ≤ N ≤ 103) indicando o número de aletas do brinquedo. A segunda linha contém dois inteiros L (1 ≤ L ≤ 103) e H (1 ≤ H ≤ 103), indicando respectivamente a distância entre as hastes e a altura das hastes do brinquedo. A haste esquerda do brinquedo está na posição 0 do eixo de ordenadas X, de forma que a haste direita está na posição L do eixo X. Cada uma das N linhas seguintes descreve uma aleta. As aletas são descritas da mais alta para a mais baixa, de forma alternada em relação à haste na qual a aleta está conectada. A aleta mais alta do brinquedo (a primeira a ser descrita) tem a extremidade ligada à haste esquerda; a segunda aleta mais alta (a segunda a ser descrita) tem a extremidade ligada à haste direita, assim alternadamente. As aletas ímpares têm a extremidade ligada à haste esquerda, as aletas pares têm a extremidade ligada à haste direita. Cada aleta é descrita em uma linha contendo três números inteiros Yi, Xf (0 < Xf < L) e Yf (0 ≤ Yf ≤ H), separados por um espaço em branco. (Xf , Yf) indica a coordenada do final da aleta; para aletas ímpares a coordenada do início da aleta é (0, Yi (0 ≤ Yi ≤ H)), e para aletas pares a coordenada do início da aleta é (L, Yi ). Para todas as aletas Yi > Yf (ou seja, há um declive entre o início e o final da aleta), e o comprimento da aleta é menor do que a largura do brinquedo. Além disso, para duas aletas consecutivas A e B, Yfa >= YiB (ou seja, o final da aleta A tem altura maior do que ou igual ao início da aleta B). Considere que as aletas são muito finas, de forma que a sua espessura pode ser desconsiderada, e que a sua largura é sempre maior do que o diâmetro da bolinha (ou seja, a bolinha sempre tem espaço lateral para deslizar pela aleta)."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1204",
        "saida": "Para cada instância imprima duas linhas. A primeira linha deve conter o primeiro ponto de contato da bola com a parede do campo e a segunda linha deve conter o segundo ponto de contato. Um ponto de contato deve ser impresso como dois números racionais separados por um espaço. Imprima os números com exatamente 3 casas decimais.",
        "descricao": "Muitas origens diferentes são atribuídas ao futebol. A atividade mais antiga que se assemelha ao futebol era praticada na China entre os séc. III e II a.C. e chamava-se ts’uh Kúh (cuju), e consistia em jogar uma pequena bola com os pés para uma rede. No Japão existe o kemari, praticado até hoje em eventos culturais. Em Roma jogava-se o harpastum, e na Grécia o epislcyros. Com a descoberta do novo mundo descobriu-se também um jogo maia muito semelhante ao futebol, o pok ta pok que teria mais de 3 000 anos de história. Na idade média jogava-se em Florença o calcio florentino, que muitos reputam ser o berço do futebol moderno. Até hoje índios do Amazonas jogam um jogo muito semelhante em que uma bola é empurrada usando apenas a cabeça em direção às metas inimigas. Seja como for, é quase  impossível dizer qual o jogo que deu origem ao futebol hoje jogado, cujas regras foram formalmente estabelecidas pelos ingleses no final do século XIX. Pouco se tem notícia de um jogo russo, também ancestral do futebol e com regras bastante claras (como diria o Arnaldo). É o Myachowski, também conhecido como Otskok. O nome vem provavelmente de Myach que significa \"bola\" em russo. No jogo um jogador entra em um campo que é uma elipse fechada e deve acertar um buraco localizado na parede do campo. Porém, o ponto só é computado se a bola entra no buraco após ser chutada contra as paredes do campo, sendo desviada para dentro do buraco. Dadas a posição inicial da bola, a direção na qual ela está se movimentando e a descrição do campo, sua tarefa é determinar os próximos dois pontos de contato da bola com a parede do campo. Considere que o centro do campo é a posição (0; 0). Reflexão da Bola: Suponha para esse problema que a bola é refletida perfeitamente quando atinge a parede do campo. Isso é, o ângulo que o vetor de entrada faz com a reta tangente à parede do campo no ponto de contato é o mesmo que ângulo de saída. A Figura abaixo exemplifica esse comportamento. Ângulo de entrada é igual ao ângulo de saída",
        "titulo": "Myachowski, o Futebol Russo",
        "entrada": "A entrada é composta por diversas instâncias e termina com final de arquivo (EOF). Cada instância consiste em uma linha contendo 6 inteiros, X, Y, Dx, Dy, (-1000 <= Dx,Dy <= 1000), A e B, (1 <= A,B <= 500). A posição inicial da bola é dada pelo ponto (X; Y ) dentro da elipse e a direção pelo vetor (Dx;Dy). O campo tem o formato de uma elipse descrita pela equação x²    y²      -  +  -  = 1. A²    B²"
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1108",
        "saida": "Para cada caso de teste da entrada seu programa deve imprimir uma única linha, contendo um número real, escrito com precisão de duas casas decimais, indicando o raio de cobertura do equipamento a ser utilizado nas duas torres. O resultado de seu programa deve ser escrito na saída padrão.",
        "descricao": "Uma nova operadora de telefonia pretende oferecer serviços de telefone residencial em sua cidade. Os telefones serão residenciais, mas a operadora vai utilizar tecnologia de telefonia celular, com torres de transmissão, para evitar os gastos de construir uma rede de cabos por toda a cidade. A potência do transmissor/receptor colocado em uma torre define o raio de cobertura da torre (que por sua vez define a área de cobertura do equipamento, que é um círculo, já que a cidade é perfeitamente plana). O custo do equipamento instalado em cada torre depende de sua potência, e portanto de seu raio de cobertura. A operadora decidiu que utilizará exatamente duas torres na cidade. O mesmo tipo de equipamento será instalado nas duas torres, ou seja, as duas torres terão o mesmo raio de cobertura. Como a operadora quer poder oferecer o seu serviço para todas as residências, a área de cobertura das duas torres em conjunto deve englobar todas as resid^encias da cidade. Adicionalmente, o raio de cobertura das duas torres deve ser o menor possível, para miniminar o custo dos equipamentos. A figura abaixo mostra duas possíveis configurações de cobertura das duas torres para uma cidade com dez residências. Tanto (a) quanto (b) oferecem cobertura a todas as residências da cidade, mas (b) é a que utiliza o menor raio de cobertura possível. Dada a localização de cada residência na cidade, você deve escrever um programa para calcular o menor raio de cobertura das torres, de forma a garantir que todas as residências sejam cobertas.",
        "titulo": "Torres de Telefonia Celular",
        "entrada": "A entrada contém vários casos de teste. A primeira linha de um caso de teste contém um número inteiro N, o número de residências da cidade (3 ≤ N ≤ 40). Cada uma das N linhas seguintes contém dois inteiros X e Y , separados por um espaço em branco (0 ≤ X ≤ 104 e 0 ≤ Y ≤ 104), representando a coordenada de uma residência. Cada residência tem uma localização diferente. O final da entrada é indicado por uma linha que contém apenas um zero."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1126",
        "saida": "Para cada caso de teste da entrada seu programa deve imprimir um único número, indicando a distância entre as duas naves, com duas casas decimais de precisão. A distância entre as duas naves é sempre maior que zero.",
        "descricao": "Há muito tempo atrás, em uma galáxia muito, muito distante, havia um império que dominava a todos. Uma aliança rebelde, descontente com essa situação, decidiu lutar contra tais forças, com o objetivo de restaurar a democracia e a paz para todos os povos. Capitão Cael, um dos comandantes rebeldes, está navegando pelo espaço com seu cruzador espacial, quando de repente percebe a presença de uma nave do Império (de acordo com os padrões estéticos da época, todas as naves são tetraedros). Após ser surpreendido por um ataque inicial do império, Cael percebe que está em posição de disparo e que pode posicionar um canhão em qualquer ponto de sua nave. Como a potência de sua arma é fixa, Cael quer posicionar seu canhão de forma que a distância percorrida pelo feixe de energia até a nave do Império seja mínima, para evitar perdas. Para isso, ele pediu para que você, sub-capitão Cin Talig, calculasse a menor distância entre a nave rebelde e a nave do Império.",
        "titulo": "Guerra nas Estrelas",
        "entrada": "A entrada contém vários casos de teste. A primeira linha da entrada contém um inteiro T, indicando o número de casos de teste da entrada. Cada um dos T casos de teste é composto de oito linhas, cada uma descrevendo a coordenada de um vértice de uma nave; as quatro primeiras linhas indicam os vértices da nave rebelde; as quatro linhas seguintes indicam os vértices da nave do Império. Cada descrição de coordenada é uma linha contendo três inteiros X, Y, Z indicando a coordenada do vértice no espaço (−103 ≤ X ≤ 103, −103 ≤ Y ≤ 103, −103 ≤ Z ≤ 103); os quatro vértices de cada nave sempre definem um tetraedro de volume não nulo e as duas naves são sempre disjuntas."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1124",
        "saida": "Para cada caso de teste, o seu programa deve imprimir uma única linha com um único caractere: ‘S’ se for possível colocar os dois cilindros no elevador e ‘N’ caso contrário.",
        "descricao": "A FCC (Fábrica de Cilindros de Carbono) fabrica vários tipos de cilindros de carbono. A FCC está instalada no décimo andar de um prédio, e utiliza os vários elevadores do prédio para transportar os cilindros. Por questão de segurança, os cilindros devem ser transportados na posição vertical; como são pesados, no máximo dois cilindros podem ser transportados em uma única viagem de elevador. Os elevadores têm formato de paralelepípedo e sempre têm altura maior que a altura dos cilindros. Para minimizar o número de viagens de elevador para transportar os cilindros, a FCC quer, sempre que possível, colocar dois cilindros no elevador. A figura abaixo ilustra, esquematicamente (vista superior), um caso em que isto é possível (a), e um caso em que isto não é possível (b): Como existe uma quantidade muito grande de elevadores e de tipos de cilindros, a FCC quer que você escreva um programa que, dadas as dimensões do elevador e dos dois cilindros, determine se é possível colocar os dois cilindros no elevador.",
        "titulo": "Elevador",
        "entrada": "A entrada contém vários casos de teste. A primeira e única linha de cada caso de teste contém quatro números inteiros L, C, R1 e R2, separados por espaços em branco, indicando respectivamente a largura do elevador (1 ≤ L ≤ 100), o comprimento do elevador (1 ≤ C ≤ 100), e os raios dos cilindros (1 ≤ R1, R2 ≤ 100). O último caso de teste é seguido por uma linha que contém quatro zeros separados por espaços em branco."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1102",
        "saida": "Para cada caso de teste da entrada seu programa deve imprimir uma única linha, contendo um número real, escrito com precisão de uma casa decimal, indicando a área da Nlogônia que seria destruída pelo ataque.",
        "descricao": "Desde que o Rei da Nlogônia construiu, décadas atrás, um enorme muro de proteção ao redor de todo o reino, os seus habitantes vivem em segurança. O muro é imponente, extremamente reforçado, e tem o formato de um círculo que envolve todos os domínios do Rei. No entanto, há algumas semanas os habitantes da Nlogônia estão apreensivos. Há boatos de que cientistas da Quadradônia, um povo bárbaro que habita as vizinhanças da Nlogônia, desenvolveram uma arma mortal, capaz de pulverizar tudo que esteja em sua mirada. A nova arma é um canhão que emite um feixe de prótons que se espalha com ângulo ø a partir da boca do canhão. A direção do tiro é indicada por um ângulo alpha, medido a partir do eixo x, no sentido anti-horário. A figura abaixo ilustra (a) um exemplo de ataque, (b) o que restaria da Nlogônia e (c) a área que seria destruída. Dados a coordenada do canhão, a direção do tiro e o ângulo de espalhamento do feixe de prótons, bem como a coordenada do centro e o valor do raio do muro de proteção, você deve escrever um programa para calcular a área da Nlogônia que será destruída.",
        "titulo": "Ataque Fulminante",
        "entrada": "A entrada contém vários casos de teste. Cada caso de teste é composto por duas linhas. A primeira linha contém três números inteiros X, Y , R, com (X, Y ) representando as coordenadas do centro do círculo do muro de proteção (0 ≤ X ≤ 1000 e 0 ≤ Y ≤ 1000), e R o seu raio (1≤R≤100). A segunda linha contém quatro números inteiros P , Q, A e T , com (P, Q) representando as coordenadas da localização do canhão (0≤P≤1000 e 0≤Q≤1000), A representando a direção, em graus, do tiro (0≤A≤359), e T representa o ângulo de espalhamento, também em graus (1≤T≤179). O ângulo A é medido a partir do eixo x no sentido anti-horário, e o canhão está sempre fora dos domínios da Nlogônia, ou seja, a distância entre (X, Y ) e (P, Q) é maior do que R. O final da entrada é indicado por uma linha que contém três zeros separados por espaços em branco."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1291",
        "saida": "Para cada linha de entrada, imprima uma única linha com a área total dos três tipos de regiões (preenchido com padrões diferentes conforme a imagem acima). Estes três números deverão ser números de ponto flutuante com três dígitos depois do ponto decimal. O primeiro número irá indicar a área da região listrada (central), o segundo número irá indicar a área total das regiões com pontos e o terceiro número irá indicar a área da região quadriculada (mais externa).",
        "descricao": "Na imagem abaixo você pode ver um quadrado ABCD, onde AB = BC = CD = DA = a. Quatro arcos são desenhados tomando os quatro vértices A, B, C, D como centros e a distância a como o raio. O arco que é desenhado tendo o vértice A como seu centro, tem início no vértice vizinho B e termina no vértice vizinho D. Todos os outros arcos são desenhados de forma semelhante. Desta forma são criadas regiões distintas que são preenchidas (hachuradas) por três padrões diferentes e que podem ser observadas na imagem abaixo. Você terá que determinar a área total de cada uma destas 3 regiões. ​",
        "titulo": "Será Isso Integração?",
        "entrada": "A entrada contém vários casos de teste e termina com fim de arquivo (EOF). Cada caso de teste é composto por uma linha contendo um número de ponto flutuante a (0 ≤ a ≤ 10000) que indica o tamanho de um lado do quadrado."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1268",
        "saida": "Para cada caso de teste da entrada, seu programa deve produzir uma linha contendo ou “Mission impossible” ou “Contact informer K”, onde \"K\" é o índice do informante (como dado na entrada) com o maior coeficiente de infiltração, que pode ser alcançado pelo espião sem ir dentro de qualquer área de cobertura de radar. Se houver mais do que um informante que satisfaça esta condição, seu programa deve imprimir aquele te tiver o menor índice.",
        "descricao": "Você foi contratado para explorar o território inimigo. É um negócio arriscado, você sabe disso. Então, é melhor você estar preparado! O inimigo colocou uma série de pontos de segurança por todo o país, a partir do qual os radares estão detectando qualquer veículo em movimento dentro de sua faixa de cobertura. Qualquer objeto detectado será imediatamente destruído. Felizmente lhe foi dado pelo seu governo um mapa do território inimigo, consistindo de coordenadas e dos raios de cobertura de cada radar. Você também tem uma lista de informantes locais (juntamente com suas localizações) com os quais poderá entrar em contato para obter informações valiosas. Sua missão é tentar entrar em contato com um desses informantes, de preferência aquele com maior coeficiente de infiltração. O coeficiente de infiltração de cada informante é simplesmente a distância do informante até a borda do país, onde tal distância é definida como o mínimo sobre todas as distâncias a partir da localização do informante até cada ponto da fronteira. Em sentido intuitivo, o informante com o maior coeficiente de infiltração é aquele que está localizado o máximo possível dentro do país e, presumivelmente, terá informações mais valiosas sobre o país. Seu primeiro pensamento é então projetar um programa de computador que vai verificar se existe um caminho de sua posição inicial, sempre o ponto (2000, 2000), até a localização de qualquer um dos informantes, sem cruzar qualquer região que é coberta pelo radar. Sempre que possível, o programa deve indicar qual informante alcançável é aquele que deverá ser contactado, de acordo com os critérios de coeficiente de infiltração acima descritos. Figura 1: Cenário Possível: o país inimigo tem a forma de um polígono simples (não necessariamente convexo).   Lembre-se que um polígono é chamado de simples se ele é descrito por um único limite não intersectado. As fronteiras do país serão dadas como uma seqüência de coordenadas X, Y correspondentes à seqüência de vértices do polígono. Você pode considerar que todos os centros do radar e coordenadas dos informantes estão localizados dentro das fronteiras do país. Note contudo, que a área coberta pelos radares podem incluir regiões de fora da fronteira.   No cenário exemplo da Figura 1, o informante I1 não pode ser conectado uma vez que ele está dentro da região coberta pelos radares. O informante I2, embora fora da região do radar, também não pode ser contactado uma vez que qualquer deslocamente até a localização dele irá através de regiões cobertas por radar, que são fatais. Ambos informantes I3 e I4 podem ser contactados e portanto, o informante I4 é o escolhido uma vez que o seu coeficiente de infiltração é maior do que o coeficiente do I3.",
        "titulo": "Missão Impossível",
        "entrada": "A entrada consiste de diversos casos de teste. A primeira linha de cada caso de teste descreve a borda do país inimigo, no formato: B X1 Y1 X2 Y2 ... XB YB  onde 3 ≤ B ≤ 1000 é o número de pontos na borda, e cada Xi Yi é a coordenada do enésimo ponto na borda. A borda do país consiste de segmentos de linha entre os pontos i e i + 1, e entre os pontos B e 1. A segunda linha denota o número de informantes e as suas respectivas posições, no formato: N X1 Y1 X2 Y2 ... XN YN  onde 1 ≤ N ≤ 1000 é o número de informantes, e Xi Yi é a coordenada do enésimo(i-th) informante. A terceira linha descreve a posição e o raio dos radares, no formato: M X1 Y1 R1 X2 Y2 R2 ... XM YM RM  onde 1 ≤ M ≤ 30 é o número de radares, Xi Yi é a coordenada do enésimo (i-th) radar, e Ri é o raio do enésimo (i-th) radar. Todas as coordenadas não inteiros 0 ≤ X, Y ≤ 1000. O raio dos radares são inteiros no intervalo 1 ≤ R ≤ 1000. Um caso de teste onde B = N = M = 0 indica o final da entrada. Este caso de teste não deverá ser processado."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1292",
        "saida": "Para cada caso de teste imprima uma linha de saída que contém um número de ponto flutuante com 10 dígitos depois do ponto decimal. Este número indica o maior lado possível de um quadrado que se encaixa no pentágono.",
        "descricao": "Solicitaram que você colocasse o maior quadrado possível dentro de um pentágono regular (cujo internos ângulos são iguais assim como todos os seus lados). Sabe-se que um vértice do quadrado vai ser coincidente com outro vértice do quadrado como é mostrado na figura abaixo. Você tem que encontrar o comprimento de um dos lados do quadrado, uma vez que você tem a informação de um dos lados do pentágono regular. ​Fig.: quadrado em um pentágono.",
        "titulo": "Problema com um Pentágono",
        "entrada": "A entrada contém vários casos de teste e termina com final de arquivo (EOF). Cada caso de teste é composto por uma linha contendo um número de ponto flutuante F (0 ≤ F ≤ 100000) que indica o tamanho de um lado do pentágono."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1137",
        "saida": "Para cada caso de teste, imprima uma única linha com um único inteiro representando o número de pontos em um dos maiores subconjuntos da entrada que são cocirculares.",
        "descricao": "Você provavelmente sabe o que é um conjunto de pontos colineares: é um conjunto de pontos tal que existe uma linha reta que passa através de todos os pontos. Um conjunto de pontos cocirculares é definido da mesma forma, mas ao invés de uma linha reta, nós queremos saber se existe um círculo tal que todos os pontos do conjunto encontram-se sobre seu perímetro. A International Collinear Points Center (ICPC) designou a você a seguinte tarefa: dado um conjunto de pontos, calcule o tamanho do maior subconjunto de pontos cocirculares.",
        "titulo": "Pontos Cocirculares",
        "entrada": "Cada caso de teste se estende por várias linhas. A primeira linha contém um inteiro N representando o número de pontos no conjunto (1 ≤ N ≤ 100). Cada uma das próximas N linhas contém dois inteiros X e Y representando as coordenadas de um ponto do conjunto (-104  ≤ X,Y ≤ 104). Em cada caso de teste, não haverá dois pontos com mesma localização. O último caso de teste é seguido por uma linha contendo apenas um zero."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1293",
        "saida": "Para cada linha de entrada, você deve produzir uma linha de saída, que contém um número de ponto flutuante F. F é a maior distância possível entre a casa de Romeu e casa de Julieta, e tem três dígitos após o ponto decimal.",
        "descricao": "Neste problema, vamos discutir os problemas de um Romeu moderno e uma Julieta moderna. Você está convidado a resolver os problemas deles para que eles não tenham que ser um par trágico como o de Shakespeare. Como de costume as famílias de Romeu e Julieta têm relações hostis e por isso eles estão trancados em dois lugares diferentes M e N. Dois canhões são colocados no local A e dois canhões são colocados no local B. Um canhão na localização A é apontado para M e o outro é apontado para N. a mesma coisa se ​​aplica aos dois canhões de localização B. M e N estão sempre no lado oposto de AB. ​Fig: Cenário parcial de Romeu e Julieta Os movimentos dos canhões, que estão visando M, estão interrelacionados, ou seja, o ângulo entre suas direções é constante. Portanto o ângulo CMD ((5 graus) ≤ (ângulo CMD) <(80 graus)) é constante. A mesma regra se aplica aos outros dois canhões. Ou seja, o ângullo ENF ((5 graus) ≤ (ângulo ENF) <(80 graus)) também é constante. Todas essas coisas são mostradas na imagem acima. Mas outra coisa que é importante e que está faltando na figura acima é que os locais N, A, M, são mantidos sempre em uma linha reta. A razão por trás disso é muito estranha. Um robô foi contratado como guarda de Romeu e Julieta. Ele tem dois olhos em lados opostos da sua cabeça e este robô é posicionado no ponto A. Para ser mais preciso, A, B e ângulo de CMD e ângulo ENF são constantes em um cenário e todas as outras posições ou valores são variáveis. Também lembro que ponto M deve permanecer sempre apontado pelos dois canhões. A mesma coisa se ​​aplica ao ponto N. O problema é que, nas noites estreladas Romeu canta a música \"Noites Azuis\" de \"Michael Learns to Rock\" em voz alta e ambos os pais não querem que Julieta ouça essa música. Então, eles querem colocar as casas (M e N), tão distantes uma da outra quanto for possível para preservar todas as restrições explicadas antes. Seu trabalho é medir esta máxima distância entre M e N e informá-la a Romeu, para que ele possa decidir se ele deve ou não cantar ou qual o volume de voz que deve usar.",
        "titulo": "Romeu e Julieta!",
        "entrada": "A entrada contém vários casos de teste e termina com final de arquivo (EOF). Cada caso de teste é composto por uma linha que coném seis valores de ponto-flutuante, x1, y1, x2, e y2 (0 ≤ x1, y1, x2, y2 ≤10000) CMD, ENF. Aqui (x1, y1) é a coordenada de A, (x2, y2) é a coordenada de B, CMD é o ângulo entre as direções dos canhões apontados na direção de M e ENF é o valor similar para o ponto N."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1294",
        "saida": "A entrada contém vários casos de teste e termina com final de arquivo (EOF). Cada linha de entrada deve produzir uma linha de saída, que deverá conter dois ou mais números de ponto flutuante com três dígitos após o ponto decimal, separados por um único espaço. O primeiro número indica o valor para o qual o volume da caixa é o máximo possível e os valores seguintes (classificados em ordem crescente) indicam os valores para os quais o volume da caixa é o mínimo possível.",
        "descricao": "Na figura a seguir você pode ver um cartão retangular. A largura do cartão é W e comprimento do cartão é L, com espessura é igual a zero. Quatro quadrados (x * x) são cortados a partir dos quatro cantos do cartão mostrado pelas linhas com tracejado preto. Em seguida, o cartão é dobrado ao longo das linhas em vermelho para fazer uma caixa sem tampa. ​ Fig.: Corte e Dobra o Cartão. Dada a largura e altura da caixa, você terá que encontrar o valor de x para o qual a caixa teria inicialmente o máximo e posteriormente o mínimo volume possíveis, separados por espaços.",
        "titulo": "A Maior e Menor Caixa",
        "entrada": "A entrada contém vários casos de teste. Cada caso de teste é composto por uma linha que contém dois valores positivos de ponto flutuante L (0 < L < 10000) e W (0 < W < 10000), o que indicam respectivamente o comprimento e a largura do cartão."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1295",
        "saida": "Para cada conjunto de entrada imprima uma única linha de saída contendo um valor de ponto flutuante (com 4 dígitos após o ponto decimal) o qual denotará a distância entre os dois pontos mais próximos. Se não existirem tais dois pontos na entrada cuja distância for menor do que 10000, imprima a mensagem \"INFINITY\" sem as aspas.",
        "descricao": "Dado um conjunto de pontos em um espaço bidimensional, você deverá encontrar a distância entre os pontos mais próximos.",
        "titulo": "Problema dos Pares Mais Próximos",
        "entrada": "O arquivo de entrada contém vários casos de teste. Cada caso de teste começa com um número inteiro N (0 ≤ N ≤ 10000), que denota o número de pontos neste conjunto. As N linhas seguintes contêm, cada uma delas, dois valores que são as coordenadas dos N pontos bidimensionais. O primeiro destes dois valores indica a coordenada X e o último indica a coordenada Y. A entrada é terminada por um conjunto cujo N = 0. Esta entrada não deve ser processada. O valor das coordenadas será um número não-negativo menor do que 40000."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1296",
        "saida": "Para cada linha de entrada seu programa deverá produzir uma linha de saída. Esta linha deve conter a área do triângulo para a correspondente entrada. Se não for possível formar um triângulo com as medianas fornecidas, deverá ser impresso o valor -1. As áreas devem ser arredondadas no terceiro dígito após o ponto decimal.",
        "descricao": "Dado o comprimento das três medianas de um triângulo, você terá que descobrir a área deste triângulo. Se você não tem muito conhecimento sobre geometria é importante que saiba que a mediana de um triângulo é formada pela conexão de qualquer vértice de um triângulo ao ponto central(médio) de sua borda oposta. Assim, um triângulo tem três medianas.",
        "titulo": "Medianas",
        "entrada": "A entrada contém aproximadamente 1000 casos de teste. Cada caso de teste é composto por três números que denotam o comprimento das medianas do triângulo. Todos os valores da entrada são menores do que 100. O final da entrada é determinado pelo final de arquivo (EOF)."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1315",
        "saida": "Para cada jogo na entrada, seu programa deve imprimir uma linha na saída, descrevendo a menor área total dentro dos invólucros. A área deve ser impresa como um número real, com duas casas decimais de precisão, e o último dígito deve ser arrredondado. A entrada não conterá casos de teste onde as diferenças de arredondamento serão significantes.",
        "descricao": "Pregos e Elásticos. Este é um nome sugestivo de um jogo que é disputado por um grupo de crianças (todas elas, filhas de professores de geometria). As crianças determinam um número de pregos em um plano de madeira, colocados aleatoriamente. Então, elas escolhem um dos pregos para ser a origem, e um número B de elásticos. O desafio é usar todos B elásticos para envolver os pregos, de modo que: (i) cada elástico envolve um subconjunto de pregos; (ii) todos os pregos estão dentro de um invólucro; (iii) invólucros não sobrepõe uns aos outros, exceto o prego de origem, que é tocado por todos os elásticos; (iv) os elásticos devem formar invólucros que são polígonos convexos, com no mínimo três cantos; e (v) a área total dentro de um invólucro é a maior de todas as formas possíveis de envolver os pregos. Uma instância do jogo é mostrada na Figura 1. Figura 1: Um jogo com 19 pregos e 2 elásticos.",
        "titulo": "Não tão Convexo",
        "entrada": "Seu programa deve resolver diversas instâncias do jogo. Cada descrição do jogo inicia com uma linha contendo dois inteiros B e N, indicando, respectivamente, o número de elásticos e o número de pregos ( 2 ≤ B ≤ 50 e 2B + 1 ≤ N ≤ 101 ). As seguintes N linhas descrevem a posição dos pregos, cada linha contendo dois inteiros X e Y ( -10000 ≤ X, Y, ≤ 10000 ). A origem é o primeiro prego na entrada. O final da entrada é indicado por B = N = 0. Em todas as instâncias da entrada: Não há dois pregos no mesmo ponto; Não há três pregos na mesma linha; O prego de origem não pertence ao fecho convexo de todos os pregos (isto é, se você usa um elástico para envolver todos os pregos, ele não toca o prego de origem);"
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1336",
        "saida": "Para cada caso de teste imprima uma linha com um inteiro representando a mínima perda possível para o jardineiro.",
        "descricao": "Gary é um jardineiro cuidadoso que possui um campo retangular repleto de árvores. Existem dois tipos de árvores em suas terras: pinheiros e larícios. Para melhorar suas vitalidades, ele decidiu começar a usar um fertilizante específico para cada tipo de árvore, em vez do fertilizante genérico que ele estava usando até agora. Como Gary possui muitas árvores, fertilizantes não podem ser colocados individualmente em cada árvore. Por este motivo ele decidiu construir uma cerca que separa o campo em dois, e usar o fertilizante de pinheiro em um lado e o fertilizante de larício no outro lado. A nova cerca será construída sobre uma linha reta conectando dois pontos distintos localizados na fronteira das terras. Infelizmente, cada fertilizante é ótimo para o tipo de árvore que ele foi projetado, mas mortal para o outro. Depois de construir a cerca e decidir que fertilizante ele irá usar em cada lado, os larícios do lado dos pinheiros e os pinheiros do lado dos larícios serão derrubados, para previnir uma morte lenta que irá arruinar a paisagem. Além disso, antes de construir a cerca é necessário derrubar qualquer árvore que esteja exatamente sobre a linha onde a cerca será construída. É claro, Gary ama suas árvores. Dependendo do seu tipo, idade e outros fatores, cada árvore possui um certo valor. O jardineiro quer construir a cerca e selecionar onde usar cada fertilizante de tal modo que sua perda seja minimizada, onde a perda é a soma dos valores das árvores que serão derrubadas. Você foi contratado para construir a cerca. Antes de começar seu trabalho, diga a Gary quanto ele perderá quando escolher otimamente a localização da cerca e o fertilizante para cada lado.",
        "titulo": "Cerca do Jardim",
        "entrada": "Cada caso de teste é descrito usando várias linhas. A primeira linha, contém dois inteiros P e L, representando respectivamente o número de pinheiros e larícios (1 ≤ P, L ≤ 1000). Cada uma das próximas P linahs descreve um pinheiro. Depois disso, cada uma das L linhas seguintes descreve um larício. As árvores são modeladas como pontos no plano XY. Cada árvore é descrita usando três inteiros X, Y e V , onde X e Y são as coordenadas da árvore (-105 ≤ X, Y ≤ 105), e V é seu valor (1 ≤ V ≤ 1000). Você pode assumir que em cada caso de teste duas árvores não terão a mesma localização. O último caso de teste é seguido por uma linha contendo dois zeros."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1345",
        "saida": "Para cada campo minado de sua entrada seu programa deverá escrever uma linha com dois inteiros A e B, onde A ≤ B, descrevendo o tamanho da posição mais segura.",
        "descricao": "Você foi contratado pela Minas Nunca Mais, uma organização não-governamental que tem como objetivo o banimento do uso de minas terrestres. Além de trabalhar no aspecto político, tal como convencer governantes a entrar na Campanha Internacional de Banimento das Minas Terrestres, MNM também trabalha desarmando minas deixadas por guerras passadas. Hoje em dia, minas são detectadas por satélites ou aviões de vigilância. Mas para desarmar uma mina você precisa chegar próximo a ela. Na maioria dos casos, a única maneira de se aproximar de um campo minado é de helicóptero. Para limpar o campo, você precisa encontrar a região mais segura dentro do campo para que o helicóptero possa pousar nela. Esta região é um retângulo com lados paralelos aos eixos das coordenadas, sem nenhuma mina dentro e sendo o menor lado o maior possível. Mais precisamente, seja A e B o comprimento dos lados de todos os possíveis retângulos com não contém nenhuma mina e A <= B; a região mais segura é um retângulo com o maior valor de A e o maior valor de B. Isto é, entre todos os retângulos que não contém nenhuma mina e nos quais o menor lado é o A (maior possível), a região mais segura é o retângulo que contém o maior B. Dado o limite do retângulo de um campo minado e as posições de todas as minas dentro deste, você deverá escrever um programa para encontrar o tamanho da região mais segura.",
        "titulo": "Região Segura",
        "entrada": "Seu programa deverá processar dados de diversos casos de teste. A primeira linha de um campo minado contém quatro inteiros X1, Y1, X2 e Y2 os quais são os limites do campo. (X1, Y1) são as coordenadas do canto inferior esquerdo do campo, (X2, Y2) são as coordenadas do canto superior direito do campo (-20000 ≤ X1 < X2 ≤ 20000 e -20000 ≤ Y1 < Y2 ≤ 20000). A segunda linha contém um único inteiro N indicando o número de minas detectadas no campo (1 ≤ N ≤ 300). As seguintes N linhas contém dois inteiros X e Y cada, descrevendo a posição da uma mina (X1 ≤ X ≤ X2 e Y1 ≤ Y ≤ Y2). Duas minas não compartilham a mesma posição. O final da entrada é indicado quando X1 = Y1 = X2 = Y2 = 0."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1358",
        "saida": "Para cada caso de teste na entrada, seu programa deve produzir uma lista ordenada de cortes que devem ser feitos para separar o grande painel nos painéis menores desejados. Cada corte deve aparecer em uma linha diferente. Um corte é descrito em quatro inteiros X1, Y1, X2, Y2, onde (X1, Y1) e (X2, Y2) especificam as marcações do corte, sendo X1 < X2 e Y1 = Y2 para um corte horizontal, e X1 = X2 e Y1 < Y2 para um corte vertical. Como mais de um corte é possível, seu programa deve imprimir a lista em uma ordem particular. Se em algum ponto mais que um corte for possível, imprima primeiramente o corte com o X1 menor; se mais de um corte ainda for possível, imprima primeiro aquele com o Y1 menor. Imprima uma linha em branco após cada lista do caso de teste.",
        "descricao": "Tio Jeff é dono de uma loja de vidros, que vende painéis de vidros para janelas e quadros de foto. Como você provavelmente sabe, um painel de vidro pode ser cortado apenas de extremidade à extremidade em linha reta. A figura abaixo mostra como o painel de vidro pode ser cortado em três painéis menores. ​ (a) painel de vidro original              (b) primeiro corte                 (c) segundo corte                  Tio Jeff normalmente opera da seguinte forma. Ele primeiro coleta vários pedidos de pequenos painéis retangulares, para janelas ou quadros de foto. Ele então marca a posição de cada painel retangular em um grande painel retangular, de forma a que nenhum deles se sobreponha. Finalmente ele realiza uma sequência de cortes verticais e horizontais, sempre de extremidade à extremidade do painel, para produzir painéis para todos os clientes. Já que a última fase (a de cortar o grande painel em pedaços) é a parte mais chata que alguém possa jamais imaginar, tio Jeff está pedindo sua ajuda. Ele quer um programa no qual dado um grande painel retangular e as coordenadas esquerdo-inferior e direito-superior de cada retângulo marcado, determine a ordem no qual cada corte de extremidade à extremidade deve ser feito. Essa lista de cortes será dada a máquina que fará os entediantes cortes para ele!",
        "titulo": "Cortando Extremidades",
        "entrada": "A entrada contém vários casos de teste. A primeira linha do teste contém um inteiro N indicando o número de janelas e quadros de foto, sendo (2 ≤ N ≤ 2000). Cada uma das próximas N linhas contém quatro inteiros X1, Y1, X2, Y2, onde (X1, Y1) e (X2, Y2) representam as coordenadas esquerda-inferior e direita-superior marcadas por tio Jeff no grande painel de vidro (-5000 ≤ X1, Y1, X2, Y2 ≤ 5000; X1 < X2 e Y1 < Y2). Você deve assumir o seguinte caso de teste: Os retângulos marcados não se sobrepõem (mas pode haver interseções nos pontos as bordas) e dividem o grande painel de vidro em regiões retângulares, de modo a não haver desperdídio. Isso significa que as coordenadas esqueda-inferior e direita-superior do grande painel podem ser inferidas com as coordenadas dos triângulos marcados. É possível partir o o grande painel de vidro em retângulos menores atravéz de uma sequência de cortes de extremidade à extremidade. O fim da entrada é indicado por N = 0."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1370",
        "saida": "Para cada caso de teste, imprima uma linha contendo o comprimento da menor rota válida possível, arredondado para duas casas decimais.",
        "descricao": "Todos os anos, desde 1996, cientistas da computação do mundo todo se encontram para a famosa Regata dos Cientistas. A competição consiste em uma corrida de barcos com obstáculos pelo oceano, onde o objetivo de cada equipe é, partindo de um ponto em comum, alcançar o ponto de chegada sem que nenhum obstáculo seja tocado ou transpassado. Uma equipe que toca ou transpassa um obstáculo é automaticamente desclassificada. A equipe vencedora é aquela que primeiro atinge o ponto de chegada (o ponto de chegada é distinto do ponto de início). Você foi contratado pela equipe brasileira para desenvolver um programa que calcule o comprimento da menor rota válida possível do ponto de partida ao ponto de chegada. O oceano é considerado um plano infinito, onde cada obstáculo é localizado em uma posição fixa e representado por um segmento de reta descrito por seus dois extremos (x1, y1) e (x2, y2). Os barcos são adimensionais (representados como um ponto no plano) e os obstáculos possuem espessura desprezível. Os obstáculos são dispostos de tal forma que os mesmos não se interceptam. De forma similar, os pontos de início e de chegada da competição não são interceptados por nenhum obstáculo.",
        "titulo": "Regata de Cientistas",
        "entrada": "A entrada é composta por vários casos de teste. A primeira linha de um caso de teste contém cinco números inteiros xi, yi, xf, yf e n, representando respectivamente as coordenadas do ponto de início (xi, yi), as coordenadas do ponto de chegada (xf, yf) e a quantidade de obstáculos (n ≤ 150). Cada uma das n linhas seguintes de um caso de teste contém quatro números inteiros x1, y1, x2 e y2 que descrevem as coordenadas dos dois extremos de um obstáculo. Considere que as coordenadas x e y de qualquer ponto satisfazem -5000 ≤ x, y ≤ 5000. O final da entrada é representado por uma linha contendo xi = yi = xf = yf = n = 0."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1464",
        "saida": "Deverá haver uma linha de saída para cada caso de teste na entrada. Para cada caso de teste imprima a string Take this onion to the lab! se a cebola deve ser levada para o laboratório ou Do not take this onion to the lab! se a cebola não deve ser levada para o laboratório.",
        "descricao": "Dr. Kabal, um reconhecido biólogo, recentemente descobriu um líquido que é capaz de curar as mais avançadas doenças. O líquido é extraído de uma cebola muito rara que pode ser encontrada em um país chamado Cebolândia. Mas nem todas cebolas de Cebolândia são apropriadas para se levar ao laboratório para processamento. Somente cebolas com um numero ímpar de camadas contém o líquido milagroso. Isto é uma descoberta ímpar! Figura 1: Cebola de Cebolândia Dr. Kabal contratou muitos assistentes de pesquisa para coletar e analisar cebolas para ele. Como ele não quer compartilhar sua descoberta com o mundo ainda, ele não disse para os assistentes procurarem por cebolas com um numero ímpar de camadas. Ao invés disso, a cada assistente foi dada a tarefa de coletar cebolas, e selecionar pontos de cada uma das beiradas da camada mais externa, isso dá uma aproximação da estrutura de camadas da cebola que pode ser reconstruída depois. Dr. Kabal disse aos assistentes que o próximo passo seria a \"análise complicada\" desses pontos. De fato, tudo que eles farão é usar os pontos para contar o número de camadas em cada uma das cebolas, e selecionar aquelas com um número ímpar de camadas. Figura 2: Pontos coletados por um assistente É claro que a aproximação obtida por Dr. Kabal, dos pontos coletados, pode ter uma aparência diferente da cebola original. Por exemplo, somente alguns pontos da cebola mostrada na figura 1 podem ser extraídos no processo, dando origem a um conjunto de pontos como mostrado na figura 2. Com estes pontos Dr. Kabal tentará aproximar as camadas originais da cebola, obtendo algo como mostrado na figura 3. O procedimento de aproximação seguido pelo Dr. Kabal (cujo resultado é mostrado na figura 3) é simplesmente recursivamente encontrar polígonos convexos aninhados tais que no fim todo ponto pertencerá a um dos polígonos. Os assistentes foram informados para selecionar pontos de tal forma que o número de camadas na aproximação, se feita desta forma recursiva, seja o mesmo que na cebola original, o que é bom para o Dr. Kabal. Os assistentes também estão cientes de que eles precisam de pelo menos três pontos para aproximar uma camada, mesmo as internas. ​ Figura 3: Aproximação do Dr. Kabal Sua tarefa é escrever um programa que, dado o conjunto de pontos coletado pelo assistente (como mostrado na figura 2), determine se a respectiva cebola pode ser levada para o laboratório.",
        "titulo": "Camadas de Cebola",
        "entrada": "A entrada contém vários casos de teste. Cada caso de teste consiste de um inteiro 3 ≤ N ≤ 2000 em uma linha simples, indicando o número de pontos coletados pelo assistente. A seguir, haverão N linhas, cada uma contendo dois inteiros -2000 ≤ X, Y ≤ 2000 correspondendo às coordenadas de cada ponto. A entrada terminará com N = 0, que não deve ser processado."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1446",
        "saida": "Você deverá imprimir um cabeçalho indicando o número da instância que está tratando (Instancia h) e nas linhas seguintes o par cor e área total visível desta cor. Estas linhas devem ser ordenadas pelas áreas, de forma decrescente. Resolva os empates de forma crescente na cor. Apenas para simplificar a apresentação, mostre os valores das áreas arredondados em duas casas decimais. Imprima uma linha em branco após cada instância.",
        "descricao": "Mickayil estava na escola estudando teoria de conjuntos. As escolas em Praga são bastante rigorosas. A professora ensinou para os alunos como desenhar diagramas de Venn para três conjuntos, e pediu aos alunos que trabalhassem com os diagramas. Para impressionar a professora com diagramas bem desenhados, Mickayil decidiu que iria fazer diagramas coloridos. Para atingir esse objetivo, ele recortou três figuras convexas usando finos papéis coloridos. Mickayil percebeu que, sobrepondo as figuras, as intersecções podiam gerar novas cores. Assim, temos três figuras convexas sobre uma superfície plana, cada figura com uma cor. Quando figuras estão sobrepostas, a cor que vemos é uma mistura das cores das figuras. Podemos representar as cores por inteiros entre 0 e 15. A mistura de cores é feita através da soma dos valores das correspondentes cores módulo 16. Queremos saber o que enxergamos ao olhar para o diagrama de Venn do Mickayil, isto é, quais cores e em que quantidade elas aparecem. Vamos medir isso através da área visível de cada cor.",
        "titulo": "Diagrama de Venn?",
        "entrada": "São dadas várias instâncias. Cada instância é composta por três figuras. Essas figuras são dadas uma por linha, com o formato ni ci xi1 yi1 xi2 yi2 ... xij yij ... xin yin​ para i = 1, 2, 3, onde 0 ≤ ni ≤ 200 é o número de pontos na borda da figura i, ci é a cor da figura i e os pares (xij , yij) representam os pontos da borda de i no sentido anti–horário, dados por inteiros. A entrada termina quando n1 = 0 (note que essa instância não deve ser processada)."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1411",
        "saida": "Para cada caso de teste, seu programa deve imprimir uma única linha, contendo o número mínimo de vértices que precisam ser removidos do polígono dado para formar um polígono regular. Se não for possível formar um polígono regular, a linha deve conter apenas o valor -1.",
        "descricao": "Um polígono é dito inscrito em um círculo quando todos seus vértices estão naquele círculo. Nesse problema você receberá um polígono inscrito em um círculo, e você deve determinar o número mínimo de vértices que devem ser removidos para transformar o polígono dado em um polígono regular, i.e., um polígono que é equiângular (todos ângulos são congruentes) e equilateral (todos lados têm o mesmo comprimento). Quando você remove um vértice v você primeiro remove o vértice e os segmentos de reta conectando-o aos seus vértices adjacentes w1 e w2, e então você cria um novo segmento de reta conectando w1 e w2. A figura (a) abaixo ilustra um polígono inscrito em um círculo, com dez vértices, e a figura (b) mostra um pentágono (polígono regular com cinco lados) formado ao remover cinco vértices do polígono em (a). ​ Nesse problema consideraremos que qualquer polígono deve ter pelo menos três lados.",
        "titulo": "Encolhendo Polígonos",
        "entrada": "A entrada contém diversos casos de teste. A primeira linha de um caso de teste contém um inteiro N indicando o número de vértices do polígono inscrito (3 ≤ N ≤ 104). A segunda linha contém N inteiros Xi separados por espaços (1 ≤ Xi ≤ 103 para 0 ≤ i ≤ N - 1). Cada Xi representa o comprimento do arco definido no círculo circunscrito, no sentido horário, pelos vértices i e (i+1) mod N. Lembre-se que um arco é um segmento da circunferência de um círculo; não o confunda com coda, que é um segmento de linha cujos ambos extremos estão no círculo. O final da entrada é indicado por uma linha contendo apenas um zero."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1455",
        "saida": "Para cada instância, imprima uma linha dizendo Instancia k, onde k é o número da instância atual. Na segunda linha, imprima a coordenada x e a coordenada y do centro e o raio da circunferência. Após cada instância, seu programa deve imprimir uma linha em branco.",
        "descricao": "Como todos sabemos, ainda não foi decidido o local da próxima ﬁnal do ICPC. Desta vez o diretor da competição, Prof. Poucher, tentou escolher uma sede que, de alguma forma, ﬁcasse o mais central possível para os vários participantes. Para resolver isso, em um grande mapa ele marcou a posição dos participantes prováveis da ﬁnal. De posse desses dados o Prof. Poucher deseja escolher a sede mais central possível, computando o centro e o raio da menor circunferência que cobre todas as cidades marcadas no mapa (uma cidade está coberta se estiver no interior ou borda desta circunferência).",
        "titulo": "Final do ICPC",
        "entrada": "Esse problema é composto por várias instâncias. A primeira linha é composta por um inteiro n (2 ≤ n ≤ 100), e indica o número de cidades. As próximas n linhas contêm a descrição do posicionamento das cidades a partir de suas coordenadas x e y no plano. As coordenadas são números reais. Seu programa deve encerrar a execução quando 0 for o valor de n dado na entrada."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1468",
        "saida": "Para cada consulta da entrada, seu programa deve imprimir uma única linha. Se o balão escapar do salão, a linha deve conter um único inteiro X, indicando a coordenada x pela qual o balão escapa do salão. Caso contrário, a linha deve conter dois inteiros X e Y indicando a posição (x, y) em que o balão fica retido no teto.",
        "descricao": "Uma das principais dificuldades de organizar uma Maratona de Programação é recolher os bal˜oes que escapam e ficam presos no teto do salão: muitas vezes o contrato com o dono do salão exige que este seja entregue limpo logo após o evento, sob pena de multa. Este ano a organização da Maratona está mais previdente: ela tem o desenho do teto do salão, e quer sua ajuda para determinar o que pode acontecer com um balão, dependendo da posição no solo onde ele é solto (isto é, se é bloqueado pelo teto ou se escapa para o exterior do salão). O teto do salão é formado por vários planos que, vistos de lado, podem ser descritos por segmentos de reta, como mostrado na figura abaixo: O balão pode ser considerado pontual. Quando um balão toca um segmento do teto que é horizontal, ele fica preso. Quando um balão toca um segmento que é inclinado, o balão desliza até o ponto mais alto do segmento e escapa, podendo escapar completamente do salão ou podendo tocar em mais segmentos. Não há pontos em comum entre os segmentos que formam o teto. Por exemplo, se o balão for solto nas posições marcadas como a ou b, será bloqueado na posição de coordenadas (2, 5); se o balão for solto na posição marcada como c, será bloqueado na posição de coordenadas (6, 5); e se o balão for solto na posição marcada como d, não será bloqueado e escapará para fora do salão na posição de coordenada x = 7. Escreva um programa que, dada a descrição do teto do salão como segmentos de reta, responde a uma série de consultas sobre a posição final de bal˜oes soltos do piso do salão.",
        "titulo": "Balão",
        "entrada": "A entrada contém vários casos de teste. A primeira linha de um caso de teste contém dois inteiros N (1 ≤ N ≤ 105) e C (1 ≤ C ≤ 105) indicando, respectivamente, o número de segmentos de reta do teto e o n´umero de consultas. Cada uma das N linhas seguintes contém quatro inteiros X1, Y1, X2, Y2, (0 ≤ X1,X2 ≤ 106, 0 X2) descrevendo um segmento de reta do perfil do teto, com extremos de coordenadas (X1, Y1) e (X2, Y2). Obs.: não há dois valores de coordenadas X iguais, considerando todos os segmentos. Cada uma das C linhas seguintes descreve uma consulta e contém um inteiro X (0 ≤ X ≤ 106) , indicando que a consulta quer determinar o que acontece com um balão solto no ponto de coordenada (X, 0)."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1982",
        "saida": "Para cada caso de teste você deverá imprimir: \"Tera que comprar uma fita de tamanho x.\", onde x é o total de fita necessário para cobrir todos os computadores, com duas casas decimais.",
        "descricao": "Acaba de chegar novos supercomputadores para os laboratórios de ciência da computação. Os funcionários do curso estão muito ocupados e as máquinas são muito pesadas, sendo assim necessitará de bastante tempo e de vários funcionários para tirarem elas do lugar, portanto nem tão cedo eles conseguirão buscar as máquinas. Figura 1: Os pontos representam como estão dispostos os computadores no depósito. Os funcionários precisam isolar as máquinas com uma fita de segurança, para poder evitar que as pessoas esbarrem ou mexam. Como na Serra tudo é muito caro, eles precisam comprar o mínimo de fita possível para passar em volta dos computadores. Devido ao peso das supermáquinas eles irão apenas dar uma volta de fita nas máquinas que estão nas bordas, sem tirar nenhum computador do lugar. Figura 2: A linha vermelha representa como deve ser feito o isolamento. Você como um aluno muito entusiasmado com as máquinas irá auxiliar na compra da fita, dizendo para eles qual a menor quantidade possível de fita se deve comprar para que seja possível isolar todos os computadores.",
        "titulo": "Novos Computadores",
        "entrada": "A entrada é composta por vários casos de teste. Cada caso de teste inicia com um inteiro N (3 ≤ N ≤ 2000), em seguida terão N linhas, cada uma contendo dois inteiros X e Y (-2000 ≤ X, Y ≤ 2000), indicando as coordenadas de cada supercomputador dentro do depósito. A entrada termina com N = 0 e não deve ser processada."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1991",
        "saida": "Para cada caso de teste, imprima uma única linha contendo um número racional que representa o comprimento em metros da ponte mais curta que liga as duas margens do rio dada no sentido NorteSul. O resultado deve ser arredondado para o número racional mais próximo com 2 dígitos decimais. Em caso de empate, o número deve ser arredondado para cima. Notese que você deve sempre imprimir 2 dígitos após o ponto, mesmo que isso signifique terminar com um zero.",
        "descricao": "Na área central da Macedónia há um rio seguindo a direção LesteOeste. Habitantes da região querem construir uma ponte que cruza o rio na direção NorteSul, uma tarefa para a qual foram contratados os fabricantes mais baratos que eles conhecem, a Short Bridge Construction Company. Como demonstrado por seu nome, esta empresa de construção especializada na construção de pontes mais curtas possíveis para cada rio. A primeira coisa que a empresa faz é modelar as margens do rio (Norte e Sul). Cada um deles é considerado como sendo formado por semicírculos de diferentes raios, alternativamente orientado para um lado ou para o outro, com todos os seus centros colineares. As duas retas que são definidas pelos centros dos semicírculos de cada margem tem a direção LesteOeste e são separados por uma distância A uma da outra. O valor A é a largura do rio. Note que se ambas as margens estão alinhadas, isto é, a margem do Norte não começa nem termina mais a oeste ou para o leste do que na margem sul. Na figura a seguir você pode ver o modelo de um determinado rio. Na margem do Norte o semicírculo mais para o Oeste está orientado para o Norte, enquanto que na margem sul o semicírculo mais para o Oeste está orientado para o Sul. Em cada margem, a orientação do próximo semicírculo alterna. A ponte mais curta possível no sentido NorteSul é a mostrada na figura. Sua tarefa é ajudar a empresa de construção a encontrar o comprimento mais curto possível da ponte que liga as duas margens do rio, no sentido Nortesul.",
        "titulo": "Fábrica de Pontes",
        "entrada": "A entrada contém vários casos de teste. Cada caso de teste é descrito por três linhas. A primeira linha contém um número inteiro A, denotando a largura do rio em metros (3 <= A <= 104). A segunda linha descreve a margem norte do rio, enquanto que a terceira linha descreve sua margem sul. A descrição de cada margem começa com um número inteiro C que indica o número de semicírculos que são utilizados para modelar esta margem (1 <= C <= 1000). Isto éseguido por um caractere \"N\" ou \"S\", que significa, respectivamente, que o semicírculo mais para o Oeste nesta margem é orientado para o Norte ou mais para o Sul. A descrição termina com C números inteiros R_i, representando o raio em metros dos semicírculos que formam a margem (1 <= R_i <A / 2 para 1 <= i <= C). Os semicírculos são dados em ordem, do que estiver situado mais para o Oeste (raio R_1) para o situado mais ao Leste (raio R_C). As orientações dos semicírculos alternam entre Norte e Sul após o primeiro semicírculo, cuja orientação é dada como descrito acima. Assumese que em cada caso de teste ambas as margen estão alinhadas, o que implica que a soma dos raios dos semicírculos que formam cada margem é o mesmo. O final da entrada é indicado por uma única linha contendo o número -1."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "2045",
        "saida": "Para cada instância solucionada, você deverá imprimir um identificador Instancia h em que h é um número inteiro, sequencial e crescente a partir de 1. Nas M linhas seguintes, você deve imprimir soldado k (para k = 1, . . . ,M) seguido de defender ou espanhol respectivamente se o soldado estiver dentro ou fora do forte. Uma linha em branco deve separar a saída de cada instância.",
        "descricao": "O forte do Alamo, originalmente chamado de Misión San Antonio de Valero, foi fundado pelos missionários para abrigar os padres e os índios convertidos na região que era disputada pelos colonos americanos e espanhóis. Foi fundado no século XVIII e serviu de palco para a mais sangrenta batalha pela emancipação do Texas. A batalha do Alamo ocorreu em 23 de fevereiro de 1836 quando o exército do Gal. Antonio Lopes de Sant’Anna cercou o forte. Texanos e “tejanos” (chamados “defenders”) defenderam a posição por 13 dias. O forte do Alamo era uma fortificação de formato bastante intricado, cercado por uma alta cerca. Muitas vezes era difícil dizer se um soldado estava dentro ou fora dos limites do forte. Sua tarefa neste problema é dada uma instância de um forte, dado pelas coordenadas dos vértices da cerca, as coordenadas da bandeira do Texas e a posição de vários soldados, determinar quais deles são “defenders” e quais são espanhóis.",
        "titulo": "Defendendo Alamo",
        "entrada": "São dadas várias instâncias. Cada instância começa com um inteiro que é o número 0 ≤ N ≤ 1000 de vértices que a cerca do forte tem. O valor 0 indica o fim dos dados. Nas N linhas seguintes vêm as coordenadas dos postes da cerca do forte. Os postes são dados a partir do primeiro, seguindo a cerca em sentido horário. A seguir vem a posição da bandeira do Texas. Na próxima linha, vem o número 0 ≤ M ≤ 1000 de pessoas a serem verificadas. Nas M linhas seguintes vêm as coordenadas das posições de cada uma das pessoas. Todas as coordenadas fornecidas são números inteiros no intervalo [−100000; +100000]."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "2043",
        "saida": "Para cada caso de teste, você deve imprimir uma única linha contendo um número racional, o que representa a área do perfil de montanha correspondente. Aproxime o resultado para o numero mais próximo de dois dígitos decimais. Em caso de empate, aproxime para cima. Note-se que você deve sempre usar exatamente dois dígitos depois do ponto decimal, mesmo que isso signifique que termine com um zero.",
        "descricao": "Para sair de férias, Horácio e Hernán sacrificaram sua participação em uma importante competição de programação. Enquanto você estiver nessa competição, eles estão perto do Andes dirigindo ao longo da estrada 40, na Argentina, desfrutando de uma vista agradável das montanhas no horizonte. Neste momento, o céu sobre a rodovia é limpo, azul, enquanto a parte visível das montanhas é um perfil apresentando texturas ricas e atraentes. Isso preocupa Horácio e Hernán, porque temem que as imagens que estão a fotografas vão ser muito caras para imprimir corretamente. Por esta razão, na próxima parada irão pegar os seus computadores portáteis e escrever um programa para calcular a área do perfil de montanha que tem de ser impresso em cada imagem. Você pode terminar este programa antes deles? Horácio e Hernán irão modelar o perfil da montanha da seguinte maneira. Cada montanha é representada por um triângulo isósceles cuja base esta sobre o eixo X do plano XY. Dois lados de igual comprimento conectam as extremidades da base ao vértice oposto do triângulo, que é a ponta da montanha correspondente. Para descrever a posição e a forma do triângulo, usámos as coordenadas ao longo do eixo X dos pontos de extremidade da base, juntamente com a altura da montanha. A figura abaixo é o modelo de um perfil formado por 4 montanha montanhas que são sobrepostas uma com a outra. A área da superfície do perfil da montanha que tem que se calcular é marcado com listras. A montanha menor da figura é descrita pelos valores I = 4 (o ponto de extremidade esquerda da base de montanha), D = 5 (a extremidade direita da base de montanha) e H = 1 (a altura da montanha) Neste problema, você terá a representação do perfil de montanha, e você tem que encontrar a área da união de todos os triângulos correspondentes, de tal forma que as partes sobrepostas são contadas apenas uma vez.",
        "titulo": "Montanha Alta",
        "entrada": "Cada caso de teste é descrito usando várias linhas. A primeira linha contém um único número inteiro N, indicando o número de montanhas (1 ≤ N ≤ 1000). Cada uma das N linhas seguintes descreve uma montanha usando três números inteiros I, D e H, que representam, respectivamente, a coordenada X do ponto de extremidade esquerda da base, o mesmo para a extremidade direita da base, e a altura da montanha (1 ≤ I, D, H ≤ 105 com I <D). Em cada caso de teste não existem duas montanhas que são exatamente a mesma (ou seja, com valores iguais para os três parâmetros I, D e H). O final da entrada é indicado por uma linha contendo -1."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "2158",
        "saida": "Para molécula imprima a quantidade de átomos e suas ligações conforme mostra o exemplo de saída.",
        "descricao": "O ano é 1986, em uma publicação científica foi divulgada a descoberta de uma molécula 3D de carbono, onde os átomos ocupam os vértices de um poliedro convexo com faces pentagonais e hexagonais, como em uma bola de futebol. Em homenagem ao professor Cláudio Carvalho, a molécula foi denominada Claudeno. Cláudio gosta muito de verificar a quantidade de átomos e de ligações em uma determinada molécula. Hoje com a idade avançada do professor ele não consegue mais fazer os calculos \"de cabeça\", e solicita que você, o estagiário cuidador de velhinhos, crie um programa que o possa ajudar.",
        "titulo": "Ajudando o Tio Cláudio",
        "entrada": "A entrada é composta por diversos casos de teste, cada entrada é composta por dois inteiros, FP e FH (1 < FP, FH < 1015), que correspondem a quantidade de faces pentagonais e hexagonais."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1497",
        "saida": "Para cada caso de teste, imprima S linhas, cada uma delas contendo um inteiro. Na enésima linha escreva o número de outros garotos que o enésimo garoto pode enxergar.",
        "descricao": "Em um playground (parque infantil), um grupo de crianças está brincando de Esconde-Esconde. Como o nome sugere, o jogo é sobre crianças se escondendo e procurando outras crianças. Cada criança, ou é uma criança que se esconde ou uma criança que procura. As crianças que se escondem apenas tentam não ser encontradas, enquanto as que procuram tentam encontrá-las. Como você pode notar, tanto as crianças que se escondem quanto as que procuram tentam não ser encontradas, e para fazer isso, elas usam algumas paredes que existem no parque. Cada parede é representada por um segmento de linha e cada criança é representada por um ponto no plano XY. Duas crianças se enxergam se e somente se o segmento de linha entre eles não fizer intersecção com nenhum segmento de parede. Sua tarefa é calcular quantas outras crianças cada criança que procura consegue ver. Para simplificar o problema, você pode assumir que as paredes não se cruzam, mesmo nas suas pontas (extremidades). Além disso, não há três pontos colineares dentro do conjunto formado por crianças e pontos de extremidade das paredes, o que implica que as crianças não estão dentro das paredes, e que não há duas crianças no mesmo local.",
        "titulo": "Esconde-Esconde",
        "entrada": "A entrada contém vários casos de teste e termina com EOF. Cada caso de teste consiste de várias linhas. A primeira linha contém 3 inteiros S, K e W, representando respectivamente o número de crianças procurando, o número total de crianças e o número de paredes do playground (1 ≤ S ≤ 10; 1 ≤ K, W ≤ 104 e S ≤ K). Cada uma das próximas K linhas descreve uma criança com dois inteiros X e Y(−106 ≤ X, Y ≤ 106 ), indicando que a localização da criança no plano XY é o ponto (X, Y); o primeiro S destas linhas descreve crianças procurando. Cada uma das próximas W linhas descreve uma parede com quatro inteiros X1, Y1, X2 e Y2 (−106 ≤ X1, Y1, X2, Y2 ≤ 106), indicando que os dois pontos finais da parede no plano XY são (X1, Y1) e (X2, Y2). Você pode assumir que os segmentos de paredes não se interseccionam e que nenhum dos 3 pontos dados na entrada são colineares."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "2083",
        "saida": "Imprimir uma única linha contendo um número inteiro que representa o número de quantidades visíveis de palmeiras que existem ao longo da estrada.",
        "descricao": "No lado da estrada, há palmeiras, há um bar, há sombra, há algo mais. Neste problema, estamos particularmente interessados ​​nas palmeiras. Ana, Adam, Alan e Amanda organizou uma viagem: enquanto Ana e Adam vão lidar com coisas insignificantes como verificar o carro, preparar a bagagem e encontrar um lugar para ficar, Alan e Amanda se dedicaram para a parte mais importante: estudar as vistas das palmeiras que eles teriam acesso na estrada. A estrada onde eles estão dirigindo agora é completamente em linha reta, e neste problema vai ser representada pela reta Y = 0 do plano XY. No lado da estrada com coordenadas Y> 0 há palmeiras, que serão representadas por diferentes pontos do plano XY com Y positivo. Alan e Amanda notaram que a partir de cada ponto na estrada certas palmeiras são visíveis, e, em geral, estes variam ao longo da estrada. Uma palmeira é dito ser visível a partir de um ponto na estrada, se e somente se o segmento que une esses dois pontos não passa por qualquer outra palmeira. Na figura a seguir no primeiro exemplo os círculos vazios representam palmeiras , enquanto os cheios representam alguns pontos possíveis na estrada. Do ponto P as palmeiras que são visíveis são A, B e D, pois a palmeira C está escondida atrás da palmeira A. Do ponto Q as palmeiras visíveis são A, C e D, pois a palmeira B agora está escondida atrás da palmeira A. Do ponto R todas as palmeiras são visíveis, e do ponto S apenas as palmeiras A e D são visíveis, pois as palmeiras B e C estão escondidas atrás da palmeira D. Enquanto Ana e Adam se revezam para dirigir o carro, Alan e Amanda discutem os benefícios de saber quantas palmeiras visíveis existem. Dado um conjunto de palmeiras, um número inteiro M é o número visível de palmeiras se, e somente se, existir pelo menos um ponto na estrada (isto é, um ponto de coordenada Y = 0) a partir do qual exatamente M palmeiras são visíveis. No exemplo ilustrado acima, 2, 3 e 4 são quantidades visíveis de palmeiras que podem ser vistas dos pontos S, P e R na estrada, respectivamente. Por outro lado, 0 e 1 não são quantidades visíveis, porque a partir de qualquer ponto da estrada, pelo menos, 2 palmeiras são visíveis. Finalmente, nenhuma quantidade M > 4 é visível, uma vez que existem apenas 4 palmeiras no total. Portanto, neste exemplo, existem 3 quantidades visíveis de palmeiras. (Note que se M é uma quantidade visível de palmeiras, pode haver mais do que um ponto sobre a estrada que apresenta esta situação; no exemplo anterior, este é o caso dos pontos P e Q para a quantidade visível 3, bem como um número infinito de outros pontos juntamente com R para a quantidade visível 4.) Ana e Adam estão ficando cansados. Eles querem que Alan e Amanda deixem de lado as palmeiras e pelo menos preparem alguns sanduíches. Por essa razão, você precisa fazer um programa para calcular quantas diferentes quantidades visíveis de palmeiras existem ao longo da estrada.",
        "titulo": "Beira da Estrada",
        "entrada": "A primeira linha contém um número inteiro N que indica o número de palmeiras que existem no lado da estrada (1 ≤ N ≤ 1000). Cada uma das N linhas seguintes descreve uma palmeira diferente usando dois números inteiros X e Y, que representam as coordenadas da referida palmeira no plano XY (1 ≤ X, Y ≤ 105). Não há duas palmeiras que compartilham a mesma posição."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "2094",
        "saida": "Imprimir na saída uma linha contendo o número que representa o raio mínimo de um círculo que abrange pelo menos P plantas. Imprima o resultado usando exatamente 4 dígitos após o ponto decimal, arredondando, se necessário.",
        "descricao": "Na Babilônia crescem algumas plantas com flores que são valorizados entre os habitantes. Florêncio é um habitante da Babilônia que tem um jardim com N plantas destas espécies e quer coletar algumas de suas flores. Como Florêncio é muito preguiçoso, não quer trabalhar duro para recolher as flores. Portando, ele decidiu andar ate algum ponto do seu jardim, e então, com um movimento circular de sua foice, ele deve cortar uma boa quantidade de plantas para depois coletar suas flores. Florêncio é muito habilidoso usando a foice, então ele irá alcançar com ela um círculo perfeito centrado onde ele está, o que irá permitir a ele cortar todas as plantas dentro do círculo, incluindo sua borda. Quanto mais alto Florêncio levantar sua foice, maior será o raio do círculo que ele irá alcançar. Ele quer cortar pelo menos P plantas, mas a sua preguiça é tanta que ele quer fazer isso levantando sua foice o mínimo possível. Florêncio conseguiu uma imagem de satélite do seu jardim, onde todas as suas plantas aparecem, e além disso conseguiu alguém para converter essa imagem em uma lista onde cada planta é representada por suas coordenadas em um plano XY. Agora ele está sentado do lado de fora, com sua foice na mão, esperando o seu time dizer a ele o raio mínimo de um círculo que cobre pelo menos P plantas.",
        "titulo": "Flores",
        "entrada": "A primeira linha contém dois inteiros N e P, indicando, respectivamente, a quantidade de plantas no jardim e a quantidade mínima de plantas que Florêncio quer cortar (1 ≤ P ≤ N ≤ 500). Cada uma das N linhas seguintes descreve uma planta diferente usando dois inteiros X e Y, que representam as coordenadas da planta no plano XY (1 ≤ X, Y ≤ 105). Não há duas plantas na mesma posição (que têm as mesmas coordenadas)."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "2104",
        "saida": "Para cada instância na entrada, imprima uma linha contendo o valor da área comprometida pela malha energética formada pelos lasers no solo terrestre, com duas casas decimais. A saída deve ser escrita na saída padrão.",
        "descricao": "Estamos no ano de 2048. Na órbita do planeta Terra existem várias plataformas flutuantes que defendem nosso planeta contra asteróides e outras coisas que possam vir a colidir aqui. Essas plataformas possuem canhões que atiram projéteis em qualquer coisa que chegue perto. Um civilização alienígena, no entanto, pretende invadir nosso planeta, mas para isso precisa passar pela barreira de plataformas flutuantes. Para tal, vai se utilizar de um super multi-canhão a laser, que consegue disparar, ao mesmo tempo, milhares de feixes de raio laser, a partir de um único ponto. Assim, eles podem mirar em todas as plataformas do nosso planeta e destrui-los todos ao mesmo tempo, sem nos dar tempo de reação. O problema maior é que os raios são tão poderosos que não se limitam a destruir as plataformas flutuantes, eles acabam atingindo a Terra depois disso. Ao atingir o solo, cada feixe de laser se transforma em uma esfera de energia, e cada esfera de energia se liga à todas as outras através de fios, também de energia, formando assim uma malha energética que não pode ser tocada. É um ataque altamente perigoso e destrutivo. Dá muita raiva. Nosso espião intergalático Austero Poderes conseguiu adentrar no canhão e descobriu a partir de onde os alienígenas pretendem soltar os raios. Como ele não consegue simplesmente desativar os canhões, a base de controle de espionagem decidiu que, já que não será possível salvar as plataformas, temos que estimar qual será o estrago feito em solo terrestre pelos lasers. Assim, sabendo onde estão as plataformas e de onde sairão os lasers, você deverá definir qual será a área comprometida pela \"malha de energia\" que se formará na Terra. Vale lembrar que no ano de 2033 descobriu-se que a Terra é, na verdade, plana.",
        "titulo": "Lasers",
        "entrada": "A entrada contém várias instâncias. Cada instância começa com um inteiro N (3 ≤ N ≤ 1000), que representa o número de plataformas flutuantes. A linha seguinte contém coordenadas (Xp, Yp, Zp), representando o local a partir de onde os lasers serão disparados. As N linhas seguintes contêm, cada uma, coordenadas (Xi, Yi, Zi), representando os locais das plataformas flutuantes. O solo terrestre é representado pelo plano XY. O ponto de disparo dos lasers sempre estará acima das plataformas. As plataformas estão em pontos distintos, e nenhum laser atinge o solo em uma coordenada (x ou y) menor que -100000 ou maior que 100000 (-100000 ≤ Xp,Yp,Zp,Xi,Yi,Zi ≤ 100000). A entrada termina quando N = 0."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1504",
        "saida": "Para cada caso de teste o seu programa deve imprimir YES se existir tal fodovia e No se não for possível construí-la.",
        "descricao": "Curo, o prefeito de Curoland, deseja construir uma ferrovia para que os cidadãos tenham um melhor transporte. A ferrovia vai ser uma linha reta que vai atravessar a cidade e a dividirá em duas regiões sem passar em nenhuma casa. Curo quer que cada região tenha o mesmo número de casas e, pra ser justo com os cidadãos de cada região, a soma das distâncias das casas de cada região até a ferrovia tem que ser a mesma. O problema é que Hailo, o melhor engenheiro da cidade, não tem certeza se é possível construir uma ferrovia com estas características. Ajude Hailo em seu trabalho.",
        "titulo": "Curo Railroad",
        "entrada": "A entrada contém vários casos de teste e termina com EOF. A primeira linha da entrada tem o número N. Seguem N (1 < N <= 100000) linhas, onde a linha i contem o par Xi, Yi (-1000 <= Xi, Yi <= 1000) que representam as coordenadas da casa i."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1549",
        "saida": "Para cada caso de teste, imprima o valor de h tal que cada copo deve ser preenchido até a altura h cm. Arredonde e imprima o resultado com exatamente 2 casas decimais.",
        "descricao": "Um grupo de N amigos foi a um restaurante almoçar. Embora cada pessoa escolheu um prato diferente para comer, todos decidiram que iriam beber Coca-Cola. O grupo pediu então uma garrafa de L ml de Coca-Cola, e deve agora dividir o conteúdo da garrafa entre as N pessoas de tal forma que todas as pessoas recebam partes iguais da bebida. Há um copo vazio para cada pessoa, que deve ser preenchido com o refrigerante que aquela pessoa irá beber. Todos os N copos são iguais, e podem ser descritos como um tronco de um cone cuja altura é H cm, cuja base menor é uma circunferência de raio b cm e cuja base maior é uma circunferência de raio B cm, como indicado na imagem. Indicação de copos preenchidos com Coca-Cola até a altura h cm Sua tarefa é ajudar o grupo a dividir a garrafa de Coca-Cola. Para tal, você deve encontrar a altura h de cada copo de tal forma que, se cada copo for preenchido com refrigerante até a altura h cm, então todas as pessoas irão receber a mesma quantia da bebida. Considere que nenhum copo será preenchido com uma quantia de refrigerante maior que sua capacidade.",
        "titulo": "Dividindo a Coca",
        "entrada": "A primeira linha de entrada contém um inteiro C que determina a quantidade de casos de teste. Cada caso de teste inicia com uma linha contendo dois inteiros, N e L (1 ≤ N ≤ 100, 1 ≤ L ≤ 108 ), indicando o número de pessoas no grupo e a quantia de Coca-Cola que deve ser dividida, em mililitros. A segunda linha contém três inteiros b, B e H (1 ≤ b ≤ B ≤ 100, 1 ≤ H ≤ 100), indicando o raio da base menor e maior do copo, assim como sua altura. Todas as medidas são dadas em centímetros."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1571",
        "saida": "Para cada linha de entrada gera-se uma linha de saída. Cada linha conterá sete números de ponto flutuante t1, t2, t3, t4, t5, t6 e t7. Aqui t1, t2, t3, t4, t5, t6 e t7 denota o tamanho do lado do triângulo para cada quadrado mostrado na figura, respectivamente. Todos os números de ponto flutuante devem ter dez dígitos depois da virgula. O saída será checada com um programa especial de correção, então erros pequenos de precisão serão ignorados.",
        "descricao": "As figuras 1, 2, 3, 4, 5, 6 e 7 mostram como 1, 2, 3, 4, 5, 6 e 8 triângulos equiláteros podem ser postos de forma ideal dentro de um quadrado. Obviamente, o tamanho do quadrado permanece igual e os triângulos da figura 1 a 7 irão diminuir. Dado o tamanho do quadrado, você terá que achar os lados dos triângulos para todas as sete figuras. Você pode assumir que a imagem é simétrica ao longo de um certo eixo. Perceba que eu estou pedindo para você mostrar o valor decimal exato da solução e não um valor aproximado.",
        "titulo": "Um Quadrado & Triângulos Equiláteros",
        "entrada": "A entrada contém várias linhas. Cada linha contém um único número de ponto flutuante S (0<=S<=10000) no qual denota o lado do quadrado. A entrada é terminada por final de arquivo (EOF)."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1613",
        "saida": "Para cada caso imprima o número de pontos que são seguros para Goemon ficar.",
        "descricao": "O lendário Ishikawa Goemon será fervido vivo em um grande caldeirão de ferro se for capturado! Para se esconder dos guardas nosso herói correu para dentro de uma casa que contém algumas paredes. Como é noite e a casa está escura os guardas jogaram uma bomba de luz para localizar o fugitivo. Tudo que for iluminado pela explosão da bomba será visto pelos guardas. A bomba emite infinitos raios de luz, em linha reta, para todas as direções partindo de seu epicentro. Podemos simplificar este cenário usando um plano cartesiano 2D, onde as paredes da casa são segmentos da reta X = 0. O epicentro da explosão de luz sempre terá coordenada com valor X 0. A imagem abaixo ilustra o cenário iluminado quando a bomba no ponto E(-12,12) explode: As paredes são descritas por segmentos de reta, e elas bloqueiam os raios de luz. No exemplo acima temos a parede A que vai do ponto A(0,0) até o ponto A1(0,2), a parede B que vai de B(0,4) até B1(0,6), a parede C que vai de C(0,10) até C1(0,12) e a parade D que vai de D(0,14) até D1(0,16). O epicentro da explosão de luz é o ponto E(-12,12) no exemplo dado, e Goemon tem as opções de ficar nos pontos G1(8,2), G2(12,14) e G3(10,10). Destes três pontos, ele só estará protegido no ponto G3, pois os raios de luz da explosão não alcançam este ponto mas alcançam os outros pontos (inclusive o G1), tornando-os visíveis para os guardas. Dado o epicentro da explosão, as paredes e os pontos que Goemon pode ficar, calcule quantos destes pontos são seguros para ele se esconder.",
        "titulo": "Goemon em Apuros",
        "entrada": "Na primeira linha você terá um inteiro T (T = 100) indicando o número de casos de teste. Na primeira linha de cada caso de teste terá a coordenada (x, y) do epicentro da explosão de luz. Na próxima linha terá um inteiro P (1 ≤ P*), indicando o número de paredes existentes. Nas próximas P linhas seguirão pares de inteiros indicando as posições das paredes, onde começa e termina uma parede (lembre-se que elas ficam no eixo Y, ou seja, X = 0). Depois haverá um inteiro G (G ≤ 100* ou G ≤ 104**) indicando os pontos candidatos para Goemon se esconder. Depois G linhas seguirão com pares de coordenadas (x, y) indicando as coordenadas dos pontos. Todas as coordenadas irão de -104 até 104 e serão números inteiros. O centro da explosão terá X 0. O Y inicial de uma parede sempre será estritamente menor do que o final. As paredes não estarão ordenadas. As paredes não se intersectarão, e não podem compartilhar um ponto inicial ou final. Pode ter posições repetidas de Goemon. *Ocorre em aproximadamente 90% dos casos de teste; **Ocorre nos demais casos de teste."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1560",
        "saida": "Para cada teste, a saída consiste de uma linha contendo a soma das energias dos triângulos formados pelos pontos pretos.",
        "descricao": "Em um plano há N pontos pretos e M pontos brancos, sem trios de pontos colineares. A energia de um triângulo é igual a K2, onde K é igual ao número de pontos brancos no interior do triângulo. Qual é a soma da energia de todos os triângulos que podem ser formados pelos pontos pretos?",
        "titulo": "Energia dos Triângulos",
        "entrada": "A entrada contém vários casos de teste. Cada caso de teste começa por um linha com dois inteiros N e M (1 ≤ N, M ≤ 100), representando o número de pontos pretos e brancos respectivamente. Após a primeira linha, seguem N + M linhas com as coordenadas inteiras X, Y (0 ≤ X, Y ≤ 10000) dos pontos pretos e brancos. As N primeiras linhas representam os pontos pretos e as M últimas linhas representam os pontos brancos."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1631",
        "saida": "Para cada caso de teste, seu programa deverá imprimir uma linha contendo um valor com 3 casas decimais que representa a menor diferença possível entre ΣESQ e ΣDIR.",
        "descricao": "Bobby está muito feliz, afinal, ganhou de aniversário um bolo circular fantástico, de 1 metro de diâmetro, decorado com muitas cerejas. Para facilitar a distribuição dos pedaços entre seus entes queridos, Bobby deseja inicialmente cortar o bolo em dois seguindo uma linha reta. Embora a reta do corte não precise passar pelo centro do bolo, ela precisa passar por ao menos duas cerejas. Além disso, sendo ΣESQ a soma, para todas as cerejas à esquerda da reta, da distância de cada cereja à reta, e sendo ΣDIR a soma, para todas as cerejas à direita da reta, da distância de cada cereja à reta, Bobby deseja que a diferença entre ΣESQ e ΣDIR seja a menor possível, como na Figura, em que as cerejas são representadas por pontos. Não obstante, pode-se considerar que cerejas partidas pelo corte não estão nem à esquerda nem à direita da reta, e que o diâmetro das cerejas é desprezível.",
        "titulo": "O Fantástico Bolo de Bobby",
        "entrada": "Vários casos de teste compõem a entrada. A primeira linha de cada caso de teste contém um único inteiro positivo N (4 ≤ N ≤ 100), o qual representa o número de cerejas no bolo. Seguem, então, N linhas, cada uma composta por dois inteiros X e Y (-50 ≤ X, Y ≤ 50, X2 + Y2 ≤ 502), os quais representam as coordenadas, em centímetros, das cerejas do bolo, considerando que o centro do bolo está posicionado na origem do plano cartesiano. A entrada é encerrada com N = 0."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1646",
        "saida": "Para cada caso de teste, imprima uma linha com a distância máxima euclidiana da origem a uma árvore visível. A distância de uma árvore deve ser medida utilizando a ponta da árvore mais próxima da origem, não importa se este ponto é, de fato, visível ou não. Imprima a resposta com três dígitos depois do ponto decimal.",
        "descricao": "Bruce Force está na floresta. Ele se pergunta qual é o tronco de árvore mais distante que não está bloqueado, a partir de seu ponto de vista, por outros troncos de árvores. Bruce fez um mapa das árvores da floresta. O mapa mostra a sua posição atual como a origem de um sistema de coordenadas cartesianas. Árvore i é ilustrada no mapa como um círculo com centro (xi, yi) e raio ri. Você pode assumir que um tronco de árvore é visível se e somente se existe um segmento de linha da origem do mapa (0,0) até um ponto na borda do círculo, que representa o tronco da árvore, onde este segmento de linha não cruza ou tocar outro círculo.",
        "titulo": "Floresta",
        "entrada": "A entrada contém vários casos de teste. A primeira linha de cada caso de teste contém um inteiro n (1 ≤ n ≤ 1000), onde n especifica quantas árvores existem no mapa. As seguintes n linhas contém três inteiros xi, yi, ri (-10000 ≤ xi, yi ≤ 10000, 1 ≤ ri ≤ 1000), onde (xi, yi) é o centro do círculo que representa tronco i, e ri é o raio do círculo. Pode-se presumir que não há dois círculos da entrada que se interceptam, ou seja, para quaisquer dois círculos, a distância entre os seus centros é mais do que a soma dos seus raios. Além disso, você pode assumir que nenhum círculo contém a origem. O último caso de teste é seguido por uma linha contendo um zero. Dica: No segundo caso de teste, as quatro primeiras árvores bloqueiam a visão de todas as árvores mais longe do que estas quatro árvores."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1651",
        "saida": "Para cada teste, mostre uma linha com o maior valor possivel do volume do cilindro. Adicione 3 casas decimais ao valor mostrado.",
        "descricao": "Usando um papel e uma tesoura, você pode cortar duas faces de um cilindro dessa maneira: Corte o papel na horizontal (paralelo ao lado menor) para ter duas partes retangulares. Da primeira parte, corte um círculo com o maior raio possivel. O círculo será a parte de baixo do cilindro. Enrole a segunda parte de um jeito que tenha o perimetro igual a circunferência, e encaixe uma parte do rolo com a circunferência. Note que o rolo possa ter papel a mais do que o tamanho da circunferência requerida",
        "titulo": "Cilindro",
        "entrada": "A entrada consiste em alguns testes. Cada teste consiste em dois números w e h (1 ≤ w ≤ h ≤ 100), que indica a largura e o tamanho do papel. O último caso de teste é seguido por uma linha contendo dois zeros."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1665",
        "saida": "Retorne uma linha de saída para cada caso de teste. Escreva \"Fail!\" se não há lugar à esquerda na parede onde a pintura poassa ser colocada sem sobrepor outra pintura. Caso contrário, escreva as coordenadas onde o canto inferior esquerdo da pintura deve ser colocado. No caso de haver mais de uma solução, selecione a solução com uma coordenada y, e diminua os laços mínimos utilizando o mínimo coordenada x. A seguinte imagem representa o segundo caso de teste:",
        "descricao": "Depois de construir sua mansão, o Sr. Rico não ficou satisfeito com as cores de suas paredes. para ele as paredes estão muito brancas. Para mudar isso, ele começou pendurar quadros de sua rara coleção. Mas logo percebeu que é muito difícil encontrar um lugar na parede onde uma pintura possa ser colocada sem sobrepor outra pintura. Agora ele precisa de um programa que informe a ele, onde colocar a próxima pintura sem mover qualquer outra pinturajá colocada na parede,(ou informe que isso é impossível). As pinturas tem formato retangular e serão colocadas paralelamente ao lado da parede. Se não houver problemas o Sr. Rico irá lhe recompensar com uma bela recompensa, vá em frente e resolva o problema.",
        "titulo": "Decorando a Parede",
        "entrada": "A primeira linha do ficheiro de entrada contém um número que representa o número de casos de teste a seguir. Cada caso de teste começa com uma linha contendo três números n, w e h. n é o número de quadros já pendurados na parede, w é a largura da parede e h é a altura da parede. As próximas n linhas contêm quatro números inteiros x1, y1, x2, y2 cada (0 ≤ x1 < x2 ≤ w, 0 ≤ y1 < y2 ≤ h); as coordenadas x fornecem a distância para o lado esquerdo da parede, as coordenadas y fornecem a distância até ao fundo da parede. (x1, y1) é a posição do canto inferior esquerdo de uma pintura, (x2, y2) é a posição do canto superior direito. A última linha de cada caso de teste contém as dimensões da próxima pintura para ser colocada, primeiro a sua largura w', então sua altura h' (1 ≤ w' ≤ w, 1 ≤ h ≤ 'h). Você não tem permissão para girar a pintura. Você pode supor que 0 ≤ n ≤ 200 e 1 ≤ w, h ≤ 1000000. Além disso, todas as pinturas já pendurados não se sobrepõem."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1679",
        "saida": "Para cada caso de teste imprima a quantidade de gelo e água, em gramas, e a temperatura final da mistura em graus Celsius. Todos os números devem ser arredondados para um dígito. Adote a saída de exemplo como o formato esperado.",
        "descricao": "Uma boa bebida é sempre servida com gelo. Dito isto, a quantidade de gelo é o que faz a diferença. Se for muito, a bebida será bem gelada, no entanto, isso é um pouco de fraude já que poderia haver menos gelo (e mais Vodka, por exemplo). Por outro lado, se há muito pouco gelo a bebida fica quente, o que é inaceitável. Você deve ajudar o garçom, é claro que não com a mistura nem com a bebida, mas com o cálculo do resultado esperado de tais misturas. Para facilitar as coisas, vamos supor que a água pura é misturada com gelo em um sistema fechado, isto é, não há nenhum problema com a temperatura exterior ou o aquecimento da garrafa, etc. Portanto, depois de um algum tempo passou, o sistema pode ser considerado como equilibrado (não há nenhuma outra alteração na temperatura e não há mais derretimento ou congelamento). Sua tarefa é calcular a temperatura final deste sistema balanceado e a quantidade de gelo e de água neste estado de equilíbrio. Como você conhece da física, é necessário 4.19 Joules para aquecer um grama de água em um Kelvin, enquanto é necessário 2.09 Joules se for gelo. Nós definimos as capacidades cw = 4.19 J/(g*K) e ci = 2,09 J/(g*K). Para derreter um grama de gelo é necessário 335 Joules, onde a temperatura permanece constante em zero. Nós definimos a constante em = 335 J/g. A energia térmica total do gelo e da água antes do experimento são iguais à energia térmica ao final da mistura. A figura abaixo mostra a energia de um grama de gelo, mistura-gelo-água, ou água, onde a temperatura é medida em relação a -30 graus Celsius. O salto em 0 graus representa o derretimento do gelo para a água. A quantidade de energia obtida é proporcional à quantidade de gelo já derretido.",
        "titulo": "Bebida, com Gelo",
        "entrada": "A entrada contém vários casos de teste. Cada caso de teste consiste de quatro números reais mw, mi, tw, ti. A massa de água mw e a massa de gelo mi são ambas não-negativas, dados em gramas, e mw + mi > 0. A temperatura da água tw e a temperatura do gelo ti são informadas na sequencia, ambos em graus Celsius, e você pode assumir que -30 < ti ≤ 0 ≤ tw < 100. O último caso de teste é seguido por quatro zeros."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1693",
        "saida": "Para cada caso de teste, imprima uma única linha contendo 'Y' se o alcance do canhão é maior que o raio do campo, ou 'N' caso contrário.",
        "descricao": "Rafael Richman é um garoto muito rico. Ele está prestes a completar 34 anos e pediu de aniversário uma arena de água para brincar com seus amigos. A arena consiste de uma campo circular plano de raio R. No centro do campo, existe uma torre de altura H. No topo da torre, existe um canhão que atira água com velocidade inicial V. Para deixar as coisas mais interessantes, sua mãe Matilda Richman comprou um dispositivo que altera a gravidade G da arena. Dadas todas as informações sobre a arena, sua tarefa é determinar se a água lançada pelo canhão consegue atravessar campo. Você pode assumir que a diferença entre o alcance do canhão e o raio do campo é sempre maior que 0.01. Rafael é um amante da física, e pode dar-lhe as equações necessárias para resolver o problema: X(t) = Vcos(a)t Y(t) = Vsen(a)t - Gt²/2 Onde X e Y são as coordenadas da água em função de t, t é o tempo decorrido desde o lançamento da água pelo canhão e \"a\" é o ângulo do lançamento com a horizontal.",
        "titulo": "Apenas Outro Problema de Física",
        "entrada": "Existem vários casos testes. Cada caso de teste consiste de uma única linha. Cada linha contém 4 inteiros, R, H, V, e G. Todos os valores dados são maiores que 0 e menores ou iguais a 10000. Todas as distâncias são dadas em metros e todas as unidades de tempo em segundos."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1721",
        "saida": "Para cada caso, imprima a frase \"M is x km off A/B equidistance.\" com M,x,A,B aproximadamente substituidos, M pelo local de encontro, x pela distancia calculada e arredonda para o mais próximo número inteiro., A pela localidade da casa de Alice, B pela localidade da casa de Bob. Se uma das localidades do caso não estiver na lista de localidades subistitua x por \"?\" .",
        "descricao": "Alie e Bob não se encontram àlgum tempo. Bob não está feliz com isso, então ele instiga Alice a marcar um encontro. Vamos ver um trecho da ligação: Alice:...talvez devêssemos nos encontrar em um lugar neutro. Bob:Eu já ouvi isso de você --- dois anos atrás. Alice:eu sei, eu só não encontrei ainda um lugar adequado a mesma distancia de mim e de você. Bob:Bom, o lugar geométrico que . é equidistante de dois dados pontos na superfície de uma esfera( e a terra está mais para esfera do que disco) é um grande circulo ( ou seja, o que intersecta o circulo grande pelos pontos dados ortogonalmente no centro deles). Se você insiste em somente numa distancia aproximadamente igual, então nós temos uma área de alguns quilômetros de largura e cerca de 40000 km de comprimento. Nem tudo nesta área é agua. Assim, eu acho que é uma tarefa possível encontrar um lugar apropriado. Alice:Agora, se eu te falar para escolher qualquer um, nós certamente acabaremos em Honolulu. Bob:O que não é uma má ideia. Então, devo escolher qualquer um? Alice:Contando que eu não tenha que aceitar --- mas estou aberta a sugestões. Bob: Honolulu ? Alice: Está na área geométrica que você falou, não? Bob: Nem tanto ... Bom. Agora vamos parar com as preliminares e chegar aos fatos: Dadas duas localizações na superfície da terra, você pode encontrar o lugar geométrico de todos os pontos equidistantes sobre a superfície. Para outro dado local, calcule sua distância para esta área geométrica. Assuma que a terra é uma esfera de raio de 6378 km.",
        "titulo": "Equidistância",
        "entrada": "A entrada consiste de duas partes: uma lista de localidades e uma lista de casos. A lista de localidade possui até 100 linhas, uma por localidade. Cada uma contém uma String S e dois números não inteiros, La, Lo, separados por espaço em branco. S representa o nome da localidade, La a latitude e Lo a longitude. Nomes são únicos e menores do que 30 caracteres e não contem espaços em branco. Latitudes estão entre -90 (Polo Sul) e 90 (Polo Norte) inclusive. Longitudes estão entre -180 e 180 inclusive, onde números negativos denotam locais à oeste do meridiano e positivos a leste. (Meridiano de Greenwich, Londres). A lista termina com uma linha com somente um caracter ‘#’. Cada linha dos casos contém três localidades, A, B, M. Assuma que, A é a localidade da casa da Alice, B é a localidade da casa do Bob, e M o terceiro local, em que pode ser o possível ponto de encontro. A lista de casos acaba com uma linha com somente um caracter ‘#’."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1730",
        "saida": "Para cada caso de teste o seu programa deverá imprimir uma linha dizendo \"Test case K:\", onde K é o número da instância atual. Então nas seguintes linhas, imprimir em linhas separadas, os nomes das localidades onde o satélite é visível na mesma ordem em que aparecem no arquivo de entrada. Imprima uma linha em branco após cada instância.",
        "descricao": "Hoje em dia vários dispositivos móveis de comunicação dependem de uma vista direta para um satélite. Portanto, para os provedores de comunicação é crucial saber onde os seus serviços estão disponíveis. Sua tarefa é identificar os locais que têm uma vista direta para um satélite particular, ou seja, este satélite deve estar acima do horizonte. Para facilitar as coisas, você pode assumir que a Terra é uma esfera perfeita com um raio de 6378km (montanhas serão adicionadas no próximo ano...). O satélite é um objeto pointlike acima da superfície terrestre.",
        "titulo": "Global Roaming",
        "entrada": "A entrada consiste de vários casos de teste. Em cada caso de teste, a primeira linha contém o número de localizações N a serem verificados, seguido pela a posição do satélite: a sua latitude, a longitude (ambas em grau) e sua altura (em km) acima da superfície terrestre. Cada uma das seguintes linhas N contém um local na superfície terrestre: o nome da localidade (uma string com menos de 60 caracteres ASCII que não contém espaços em branco), seguido por sua latitude e longitude (ambos em graus). A entrada é terminada por N = 0."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1748",
        "saida": "Imprima uma linha com dois inteiros P e A que representam, respectivamente, o perímetro em milímetros e a área em milímetros quadrados da cerca que Alice e Bob querem construir.",
        "descricao": "Na tenra idade de 40 anos, Alice e Bob decidiram se aposentar. Depois de mais de duas décadas de trabalho como exemplos para protocolos de rede, livros teóricos sobre jogos e de vários outros textos, eles estavam cansados. Para se manterem ativos, eles decidiram praticar jardinagem. Alice e Bob plantaram vários vegetais em um campo enorme. Após terminar, eles perceberam que as suas plantas precisavam de proteção contra animais selvagens, por isso eles decidiram construir uma cerca em volta deles. O campo é representado como o plano XY, e cada vegetal é representado por um ponto diferente no mesmo. Uma cerca é representada como um polígono no plano. No entanto, nem todo polígono é uma cerca válida. Uma carca deve ser um único polígono simples com cada um dos seus lados paralelos a um dos eixos. Naturalmente, o polígono tem de conter todos os pontos que representam os vegetais. Uma cerca muito perto das plantas ou de si mesma poderia tornar difícil passear pelo campo, desta forma cada lado do polígono precisa ter, pelo menos, um milímetro de distância de todas as outras plantas e de todos os lados não adjacentes. Entre todas as cercas válidas, Alice e Bob decidiram construir aquela com menor perímetro, a fim de economizar no material. Se existem várias cercas válidas com perímetro mínimo, eles querem construir uma com área mínima entre aquelas disponíveis, para economizar tempo quando forem regar seu jardim. Nas imagens seguintes, várias cercas diferentes são mostrados em um campo com quatro vegetais representados como círculos. Por sorte, Alice e Bob já participaram de projetos científicos rigorosos e por isso ele foram muito cuidadosos com seus registros: eles sabem a localização exata de suas plantas com precisão milimétrica. Usando esses dados, ajude-os a calcular o perímetro e a área de uma cerca ideal.",
        "titulo": "Cerque Os Vegetais",
        "entrada": "A primeira linha contém um inteiro V (1 ≤ V ≤ 105) representando o número de vegetais no campo de Alice e Bob. Cada uma das V linhas seguintes descreve um vegetal diferente com dois inteiros X e Y (1 ≤ X, Y ≤ 108), indicando as coordenadas da planta, em milímetros. Não há duas plantas em um mesmo local."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1783",
        "saida": "Para cada caso imprima uma linha contendo \"Caso #i: X Y\", onde i é o número do caso atual, iniciando em 1, e (X, Y) são as coordenadas de onde o buraco negro deve estar. X e Y são números reais com 2 casas decimais cada um. Para cada caso haverá exatamente uma solução válida.",
        "descricao": "André é um astrônomo amador que luta para revelar uma verdade ao mundo: há um buraco negro em direção à Terra! Todos os outros astrônomos tratam ele feito louco, e por consequência, as pessoas normais também, mas ele não desiste de derrubar essa conspiração! Mas como ele descobriu esse buraco negro? Foi assim: buracos negros possuem uma gravidade avassaladora, e todas as estrelas próximas a um começam a girar em torno dele. Algumas mais rápidas, outras mais lentas, algumas mais próximas, outras mais distantes, mas sempre mantendo velocidade angular e distância do buraco negro constantes. Ao observar o céu com seu telescópio um certo dia, André anotou as posições de todas as estrelas que viu. Um mês depois, repetiu a experiência e viu que duas certas estrelas haviam se movido, o que indica que caíram na órbita de um buraco negro! A imagem acima ilustra a trajetória de duas estrelas ao redor do buraco negro. Porém, André não é bom em matemática, e ele não sabe como calcular a posição exata do buraco negro. A superfície do céu pode ser representada por um plano coordenado por eixos X e Y, e ele possui as coordenadas antigas e novas das duas estrelas. Ajude-o calculando as coordenadas do buraco negro no céu e salve o mundo antes que seja tarde demais!",
        "titulo": "Ih, Ferrou, um Buraco Negro!",
        "entrada": "A primeira linha contém um inteiro T (1 ≤ T ≤ 10000), o número de casos de teste. Cada caso de teste possui 4 linhas, cada uma com um par de números reais com 2 casas decimais, X e Y (-1000.0 ≤ X, Y ≤ 1000.0). Cada par representa, respectivamente, as antigas coordenadas da primeira e da segunda estrela, e as novas coordenadas da primeira e da segunda estrela. As posições antiga e nova de cada estrela são diferentes, assim como as posições de duas estrelas no mesmo instante de tempo."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1797",
        "saida": "A saída de seu programa deve consistir de uma só linha, contendo a palavra YEAH caso a fuga seja possível ou a palavra OUCH caso não seja.",
        "descricao": "Vin Gasoline e seu melhor amigo Paul Runner estão na cobertura de um edifício em Abu Dhabi roubando um Lykan HyperSport. É o ano de 2300, e os andares dos prédios não mais se sustentam um sobre o outro, mas são todos flutuantes e movem-se de vez em quando, apenas mantendo sua altitude. No prédio em que nossos heróis estão, os andares são todos quadrados. A figura à esquerda ilustra o prédio como visto de cima e a figura à direita o ilustra como visto de frente, representando o solo pela linha mais espessa. Gasoline e Runner querem abandonar o prédio o mais rápido possível e precisam, portanto, acelerar o supercarro para pular da cobertura para o penúltimo andar, do penúltimo para o antepenúltimo andar, e assim sucessivamente até chegarem ao solo e fugirem. Eles sabem que o Lykan HyperSport aguenta pular de um andar i para um andar j se e somente se j = i - 1 e a distância horizontal necessária a ser percorrida no ar não é maior que AAH, o Alcance Aéreo Horizontal do carro. Com o computador de bordo, eles têm todas as informações pertinentes à localização dos andares, mas precisam rapidamente calcular se a fuga será possível ou não.",
        "titulo": "Ferozes e Curiosos",
        "entrada": "A primeira linha da entrada estabelece o número N de andares do edifício (1 ≤ N ≤ 106) e o valor de AAH (0 < AAH < 2 × 104). Cada uma das N linhas seguintes descreve um andar do edifício através de 3 inteiros: XC, YC e L (0 < XC, YC, L < 104), os quais representam respectivamente as coordenadas do centro e o comprimento do lado do andar. Os andares são descritos em ordem decrescente de altitude."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1818",
        "saida": "Para cada instância solucionada, você deverá imprimir um identificador Instancia h em que h é um número inteiro, sequencial e crescente a partir de 1. Na linha seguinte você deve imprimir a posição x y ideal para o ponto central do centro de convenções. Caso exista mais que um ponto ideal para a construção, imprima aquele com o menor valor para x. Caso ainda exista mais que uma opção, imprima aquele com o menor valor para y. Trunque os números impressos em exatamente três casas decimais. Caso não seja possível construir o centro, escreva a palavra impossível na linha. Uma linha em branco deve separar a saída de cada instância.",
        "descricao": "Já com a Final Mundial da Maratona de Programação em mente, o governo chinês iniciou um projeto para a construção de um centro de convenções novo. Esse centro será o mais moderno do mundo, com toda a infraestrutura para sediar importantes eventos. O governo já decidiu (e se decidiu está decidido) construí-lo no formato de uma circunferência. Quando visto de cima esse novo centro, com auxílio de toda sua iluminação de ultima geração, irá dar a impressão de ser uma grande nave espacial redonda. Com truques de luzes, pretende-se ainda criar a impressão de movimento para o imponente prédio. Porém todos sabem que a China possui um grande problema de espaço físico, e o único lugar disponível para a construção fica nos arredores de uma antiga floresta de árvores milenares. Para deixar o projeto ainda mais atraente, decidiu-se que o centro será construído dentro da floresta, mas sem derrubar uma única árvore. A sorte do projetista é que a floresta é esparsa, e existe bastante espaço entre as árvores em alguns lugares. Como se deseja criar o maior (no sentido da área construída) centro de convenções possível, sua tarefa é ajudar a encontrar o melhor lugar para a construção. Seu objetivo é encontrar as coordenadas do ponto central da construção, que deve estar dentro do fecho convexo induzido pelas árvores.",
        "titulo": "Centro de Convenções",
        "entrada": "A entrada é composta de diversas instâncias. Cada instância inicia-se com uma linha contendo o número 0 ≤ n ≤ 1000 de árvores da floresta, seguida por n linhas contendo os pares ordenados xi yi, que representam as coordenadas das árvores da floresta. Todas as coordenadas dadas são inteiras. A entrada termina com n = 0."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1825",
        "saida": "Para cada cenário, você deverá escrever uma linha no arquivo de saída, com um dos seguintes conteúdos: No caso da formiga morrer de fome, a espressão \"Morreu...\" Caso contrário, você deverá escrever: A porcentagem das comidas que foram devoradas na peregrinação da formiga rumo à saída (com três digitos, espaços à esquerda se for o caso, arredondado para o inteiro mais próximo, ou para baixo, no empate, seguido seguido do sinal %); A quantidade de trombadas que a formiga deu nas paredes do retângulo (10 casas, alinhado à direita, espaços à esquerda); A porta pela qual ela saiu. A imagem a seguir é sobre o exemplo abaixo:",
        "descricao": "Um grupo de cientistas malucos da ACGOP (Academia de Ciência e Ginástica Olímpica Pindamonhangabense) está estudando o comportamento de uma estranha raça de formigas cegas. Após anos de estudo, eles concluíram que: Essas formigas só andam em linha reta e seu comportamento é o mesmo da luz. Ou seja, quando encontram uma parede pela frente, sua rota é \"refletida\" (como se fosse um raio de luz incidindo num espelho plano) e ela segue andando de modo que sua rota forme com o obstáculo um ângulo igual ao de incidência; Essas formigas só param quando passam por um alimento e voltam a andar no mesmo sentido que vinham logo após devorar o alimento; O máximo que uma formiga consegue viajar sem morrer de fome é 2 metros. Para comprovar essas conclusões, os cientistas construíram uma série de cenários, onde eles colocariam as formigas para andar. Cada cenário consiste num retângulo de dimensões M x N metros com 4 entradas, situadas nos vértices, que de agora em diante chamaremos pelos nomes dos pontos cardeais, conforme a figura: Dentro do retângulo foram distribuidas MN comidas, colocadas no centro de cada quadrado de 1 metro de lado interior ao retângulo. As formigas são introduzidas nos retângulos por uma das quatro portas numa rota que forma 45 graus com os lados do retângulo de modo que, após percorrer aproximadamente 0,707 metros, alcançam o primeiro alimento e, em seguida, continuam suas viagens pelo mesmo caminho, até que uma das três situações ocorra: A formiga bate na parede: neste caso sua rota é refletida e ela segue andando de modo que sua rota forma com a aparede um ângulo igual ao de incidência (ou seja, permanece 45 graus); A formiga anda mais de 2 metros e não encontra comida: nesse caso ela morre (tadinha); A formiga encontra uma porta: nesse caso ela sai e o experimento está concluído. Sua missão é escrever um programa que preveja o que vai acontecer com a formiga colocada em cada um dos cenários da pesquisa.",
        "titulo": "Formigando",
        "entrada": "A entrada consistirá de diversos cenários. Para cada cenário serão fornecidas, numa única linha, as medidas do retângulo, primeiro a largura M (Norte - Oeste), depois a profundidade N (Norte - Leste) (0 < m,n ≤ 100.000), e a porta por onde entrou a formiguinha. Uma linha contendo o valor 0 para uma das dimensões do retângulo marca o final da entrada."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1834",
        "saida": "O relatório a ser impresso contém várias linhas. A primeira delas deverá conter a mensagem \"Relatorio Vogon #35987-2\". Em seguida, deve ser impressa, em uma linha, a mensagem \"Distancia entre referencias: d anos-luz\", onde d é a distância entre os dois pontos de referência pelos quais a autoestrada deve passar, em anos-luz, com duas casas decimais de precisão. Na linha seguinte deve ser impressa a mensagem \"Setor Oeste:\" e, nas duas linhas seguintes, as mensagens \"P planeta(s)\" e \"H bilhao(oes) de habitante(s)\", onde P é o número de planetas que ficaram à esquerda da autoestrada, quando se viaja no sentido do primeiro ponto de referência ao segundo, e H é o total de habitantes destes planetas. De modo semelhante, devem ser produzidas três mensagens equivalentes para o Setor Leste, que fica à direita da autoestrada. Por fim, deve ser impressa a mensagem: \"Casualidades: P planeta(s)\", onde P é o número de planetas que estavam na rota da construção da autoestrada e, naturalmente, tiveram que ser dizimados.",
        "descricao": "Os vogons são uma raça alienígena que habita a Vogosfera, segundo o \"Guia do Mochileiro das Galáxias\", escrito por Douglas Adams. Nas palavras do próprio autor: \"Here is what to do if you want to get a lift from a Vogon: forget it. They are one of the most unpleasant races in the Galaxy. Not actually evil, but bad-tempered, bureaucratic, officious and callous. They wouldn't even lift a finger to save their own grandmothers from the Ravenous Bugblatter Beast of Traal without orders - signed in triplicate, sent in, sent back, queried, lost, found, subjected to public inquiry, lost again, and finally buried in soft peat for three months and recycled as firelighters. The best way to get a drink out of a Vogon is to stick your finger down his throat, and the best way to irritate him is to feed his grandmother to the Ravenous Bugblatter Beast of Traal. On no account should you allow a Vogon to read poetry at you.\" No romance, os vogons foram os responsáveis pela destruição da Terra, pois ela ficava na rota de construção de uma autoestrada intergalática. Este é típico modo de trabalho vogon: muitas raças já foram exterminadas e planetas inteiros destruídos para que o trânsito entre as galáxias ficasse menos congestionado. Dados dois pontos de referência, pelos quais a nova autoestrada intergalática passará em linha reta, e as coordenadas e habitantes dos planetas do setor espacial, escreva um programa que gere um relatório para os vogons.",
        "titulo": "Vogons!",
        "entrada": "A primeira linha da entrada contém as coordenadas X1, Y1, X2, Y2 (-10.000 ≤ Xi, Yi ≤ 10.000) dos pontos de referência P1 e P2 pelos quais a autoestrada passará em linha reta, separadas por um espaço em branco. As coordenadas são números inteiros e a unidade de distância é o ano-luz. A segunda linha da entrada contém o número N (1 ≤ N ≤ 1.000) de planetas que fazem parte do setor espacial onde a estrada passará. As próximas N linhas contém, cada uma, as coordenadas X e Y (-10.000 ≤ X, Y ≤ 10.000) do planeta e o número H (1 ≤ H ≤ 100.000) de habitantes, em bilhões. Estes valores são números inteiros separados por espaços em branco."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1844",
        "saida": "Imprima uma linha constituída unicamente por um valor que representa a soma total ótima dos comprimentos das trilhas que conectam as relíquias. Como a empresa contratada para construir as trilhas cobra por unidade inteira de trilha construída, se o valor não for inteiro arredonde-o para cima.",
        "descricao": "A cultura dos povos nativos do Brasil está morrendo! Enquanto que se estima que no séc. XV havia mais de mil povos indígenas no Brasil, hoje há o registro de apenas 215 povos. Recentemente, foram descobertas na região do oeste catarinense relíquias fósseis atribuídas a um povo indígena extinto. As relíquias tratam-se provavelmente de bases de muros de edificações. A figura abaixo ilustra algumas relíquias encontradas representando cada relíquia por um segmento de reta. Agora, o Governo quer transformar todas as terras em que estão as relíquias em área de preservação ambiental. Para facilitar o trabalho dos arqueólogos, o governo também construirá trilhas, cada uma conectando duas relíquias. A intenção é construir o mínimo possível de trilha, a fim de que o impacto ambiental seja o menor possível, mas que haja caminho entre quaisquer duas trilhas. A figura abaixo ilustra uma maneira de construir trilhas entre as relíquias da figura acima de modo a minimizar a soma total dos comprimentos das trilhas.",
        "titulo": "As Relíquias da Morte",
        "entrada": "A primeira linha da entrada é constituída unicamente por um inteiro N (1 ≤ N ≤ 103), o qual representa o número de relíquias encontradas. Cada uma das N linhas seguintes descreve uma relíquia através de quatro inteiros, xA, yA, xB e yB (0 ≤ xA, yA, xB, yB ≤ 104), os quais representam as coordenadas dos extremos (xA, yA) e (xB, yB) do segmento de reta, de comprimento não necessariamente positivo, que representa a relíquia."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1857",
        "saida": "Imprima uma linha contendo unicamente o valor exato da área da terra que Robb Stark recebeu, sem zeros desnecessários à esquerda ou à direita.",
        "descricao": "Poucos sabem que, na série de eventos que antecederam o sangrento Casamento Vermelho, Lorde Frey prometeu a Robb Stark uma parte do território das Terras Fluviais, além de uma mansão. As exatas palavras que Lorde Frey disse a Robb Stark, numa reunião nas Gêmeas, foram: — Aqui está o mapa das Terras Fluviais e de todas as construções que existem nelas. Coloque um prego em cima da localidade onde você deseja que seja construída sua mansão. Escolha a localidade que quiser, desde que ela não fique em cima nem ao norte de uma construção já existente. Ainda, se a localidade que você escolher ficar na mesma latitude que outra construção, a outra construção deverá estar mais a leste que a sua localidade. E assim procedeu Robb Stark. Lorde Frey, então, continuou: — Pegue agora estes outros pregos e ponha-os em cima de construções já existentes, para que lhe pertençam também. Escolha as construções que quiser. Saiba que, após terminar, eu esticarei este elástico em volta de todo o mapa e o soltarei, de modo que o elástico seja parado pelos pregos. Todo o território no interior ou sobre a fronteira da região definida pelo elástico será seu. No entanto, não abuse de minha benevolência. Se a área do seu território exceder B metros quadrados, eu lhe cortarei fora a cabeça aqui mesmo. Robb fez sua escolha de modo a possuir a maior área de terra possível mantendo sua cabeça, pelo menos por um tempo. Você é capaz de adivinhar qual área ele obteve?",
        "titulo": "Prelúdio de um Casamento Vermelho",
        "entrada": "A primeira linha da entrada consiste de dois inteiros, N e B (0 ≤ N < 100, 1 ≤ B ≤ 103), os quais representam respectivamente o número de construções já existentes no mapa e o limite para a área do território de Robb Stark estabelecido por Lorde Frey. A segunda linha consiste de dois inteiros, Xm e Ym (0 ≤ Xm, Ym ≤ 104), os quais representam respectivamente a latitude e a longitude da localidade que Robb escolheu para a construção da mansão. Cada uma das N linhas seguintes é composta por dois inteiros X e Y (0 ≤ X, Y ≤ 104), os quais representam respectivamente a latitude e a longitude de cada construção."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1875",
        "saida": "Para cada caso de teste, imprima o resultado da partida no tempo normal, baseado nos gols que foram marcados.",
        "descricao": "Na cidade de Triangulândia, o maior sonho de sua população era construir um campo de futebol, mas lá todos os terrenos são triangulares. Se fosse para fazer um campo retangular, uma boa parte do terreno não seria aproveitada para construir o campo. Então, os irmãos Hipo e Tenusa tiveram uma grande ideia: A criação de um novo jogo, derivado do futebol, mas jogado em um campo triangular, e chamaram o jogo de Tribol. As regras eram simples: Jogam três equipes ao mesmo tempo: Red, Green e Blue. A partida tem um tempo de trinta minutos. A equipe que fizer um gol no adversário do sentido anti-horário ao mesmo, é um gol normal. A equipe que fizer um gol no adversário do sentido horário ao mesmo, vale o dobro. Se as três equipes fizerem a mesma quantidade de gols, ocorre um trempate Se as duas equipes que fizerem mais gols tiverem feito a mesma quantidade, ocorre um empate, e o jogo é decidido por pênaltis. A equipe que fizer mais gols, vence. Exemplo de partida. Os times estão dispostos no campo igual à imagem abaixo. A equipe Green faz um gol na equipe Blue e um gol na equipe Red, totalizando 3 gols; A equipe Blue faz dois gols na equipe Green, totalizando 2 gols; A equipe Red faz dois gols na equipe Green, totalizando 4 gols e vencendo a partida.",
        "titulo": "Tribol",
        "entrada": "Haverá diversos casos de teste. O primeiro número a ser lido será um inteiro C, representando a quantidade de casos de teste. Cada caso de teste se inicia com um número inteiro P, representando a quantidade de gols na partida. A seguir serão lidos P linhas, cada um com dois caracteres M e S, indicando a primeira letra do time que marcou o gol e a primeira letra do time que sofreu o gol, respectivamente."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1971",
        "saida": "A saída deve consistir de exatamente três linhas com exatamente três caracteres cada, representando se o estudante deve se render ou se pode continuar correndo. Os exemplos esclarecem quais caracteres devem ser impressos.",
        "descricao": "Numa insurreição, um estudante resolveu fugir da Frida, mas foi seguido por quatro policiais. Num dado momento da perseguição, os policiais gritaram: Pare! Você está cercado! Agora, o estudante quer saber se realmente está cercado, situação em que deve se render, ou se pode continuar fugindo. Dizemos que o estudante está cercado pelos policiais se os policiais não estão todos sobre uma mesma reta e se o estudante se encontra no interior ou na fronteira do único polígono formado pelos policiais (sim, se os policiais não estão todos numa mesma reta, é garantido que o polígono formado por todos eles é único).",
        "titulo": "Insurreição",
        "entrada": "A entrada consiste de cinco linhas contendo dois inteiros X e Y cada (0 ≤ X, Y ≤ 104). As quatro primeiras linhas representam as coordenadas dos quatro policiais, e a última linha representa as coordenadas do estudante. Dois corpos não podem ocupar o mesmo lugar no espaço."
    },
    {
        "nivel": "",
        "assunto": "",
        "numero": "1938",
        "saida": "Seu programa deve produzir uma única linha contendo o número de diferentes localizações possíveis para a praça.",
        "descricao": "Retangolândia é uma cidade muito antiga e, por isso, guarda diversas riquezas históricas. A cidade foi planejada muitas décadas atrás, com todas as suas ruas indo nas direções norte-sul ou leste-oeste. Atualmente, há um projeto de revitalização da cidade, no qual uma nova praça retangular será feita. A escolha da nova praça será feita pela administração pública mas, no momento, eles estão interessados em quais seriam as posições possíveis para esta praça, levando-se em consideração que a praça deve estar alinhada com as ruas e, assim, quando visualizada em um mapa, seus lados devem ser segmentos horizontais e verticais. Com o objetivo de conciliar as riquezas históricas com as novas iniciativas, alguns cuidados devem ser tomados. Existem postes de iluminação, do século XIX, espalhados pela cidade. Por seu valor histórico, nenhum poste pode ser derrubado. Por conta do desgaste natural e da falta de manutenção, nenhuma rua possui mais do que um poste restante. Para o posicionamento da praça, entretanto, não se deseja que um destes postes esteja no interior da mesma. Por outro lado, o projeto paisagístico da nova praça prevê que dois dos postes históricos estejam em duas das esquinas. A figura abaixo mostra um exemplo com quatro postes e as três localizações possíveis para a praça. A prefeitura contratou uma empresa de georeferenciamento para efetuar um levantamento das posições dos postes. Com esses dados em mãos, o próximo passo é determinar quantas são as localizações possíveis para a praça, para que se possa dimensionar o tamanho da equipe necessária para avaliar cada uma das localizações.",
        "titulo": "Praça do Retângulo",
        "entrada": "A primeira linha da entrada contém um número inteiro N, 1 ≤ N ≤ 3000, representanto o número de postes. As N linhas seguintes descreverão, cada uma, a posição de um poste. A posição de um poste será dada por um par de números inteiros, X e Y, −108 ≤ X, Y ≤ 108 , correspondendo às suas coordenadas no plano."
    }
]